{
  "posts": [
    {
      "id": "1r8imk4",
      "title": "I tracked cognitive function across 3 sleep protocols and the results made no sense",
      "subreddit": "Biohackers",
      "score": 3,
      "numComments": 2,
      "createdUtc": 1771456378,
      "selftext": "I ran a 6 week experiment on myself. 2 weeks each of strict 8hr sleep, polyphasic 90min cycles, and sleep restriction at 6hrs w consistent wake time. tracked reaction time and working memory same time every morning before coffee\n\nsubjectively the 8hrs felt best by far, obviously, bc more sleep is always better right? but the actual cognitive data told a completly different story. sleep restriction produced the sharpest morning reaction times consistently, by about 12-15ms average. working memory accuracy was roughly the same across all three but speed of retrieval was fastest on restricted sleep\n\nmy theory is sleep pressure consolidation. when you compress sleep into fewer hours your brain prioritizes deep/slow wave and you get denser restorative cycles. the 8hr nights probably had more light sleep padding that felt restful but wasn't doing much cognitively\n\nI'm not saying sleep less. the 6hr protocol felt like shit and I was irritable by week 2. but it forced me to realize how unreliable \"feeling rested\" is as a metric for actual brain performance\n\nanyone else found their best-feeling sleep schedule doesn't match their best-performing one?",
      "permalink": "/r/Biohackers/comments/1r8imk4/i_tracked_cognitive_function_across_3_sleep/",
      "mentionsSoma": false
    },
    {
      "id": "1r6rbkg",
      "title": "Neuroplasticity Isn't Always Good",
      "subreddit": "HubermanLab",
      "score": 47,
      "numComments": 17,
      "createdUtc": 1771288751,
      "selftext": "not shitting on anyone here bc this community is more science literate than most. but the way plasticity gets discussed is almost always \"more = better\" and that's like saying more gene expression is always good. it depends entirely on what's being expressed\n\nI studied neural circuits for my phd and maladaptive plasticity was a huge chunk of the research. your brain reinforcing anxiety loops, doomscroll attention patterns, chronic pain circuitry. that's all plasticity too. it doesn't have a direction preference, it just strengthens whatver you repeat most\n\nhuberman covers the upregulation side well but mostly skips the fact that plasticity is always running, including on your worst habits. the more interesting question imo isn't \"how do I boost plasticity\" it's \"how do I know which direction my plasticity is actually going\"\n\nand thats genuinely hard to answer without some kind of objective cognitive tracking. bc subjectively you can feel sharper while your sustained attention is quietly degrading month over month. stimulants are a perfect example bc you feel sharper but actual working memory stays flat or gets worse\n\ncurious if anyone here is measuring cognitive baselines over time or mostly going by how protocols feel",
      "permalink": "/r/HubermanLab/comments/1r6rbkg/neuroplasticity_isnt_always_good/",
      "mentionsSoma": false
    },
    {
      "id": "1r6r2qc",
      "title": "The Psychological trap of wearable scores",
      "subreddit": "ouraring",
      "score": 59,
      "numComments": 38,
      "createdUtc": 1771288106,
      "selftext": "been thinking about this bc I see it constantly in this sub. people waking up, checking their readiness score, and literally deciding how to feel about their day based on a number. someone posted recently they went back to bed for an hour bc their ring said 38\n\nthis is a real phenomenon and its not just \"oh I'm being silly.\" checking your score first thing in the morning creates a dopaminergic anticipation loop - your brain starts treating the score reveal like a slot machine pull. high number = reward signal, low number = threat response. over time you're training your nervous system to be reactive to a metric instead of actually listening to your body\n\nthe irony is brutal. the thing you bought to reduce health anxiety becomes the source of it. I did my phd in computational neuroscience and this pattern maps almost perfectly onto conditioned stress responses - your cortisol spikes before you even process the number consciously\n\nthe data is genuinely useful, that's not the issue. the issue is the feedback loop - if checking a bad score spikes your morning cortisol, that suppresses your HRV that night. so you can end up in this cycle where the metric is partially generating the next bad number. doesn't mean stop tracking, just means the relationship w/ the data matters as much as the data itself",
      "permalink": "/r/ouraring/comments/1r6r2qc/the_psychological_trap_of_wearable_scores/",
      "mentionsSoma": false
    },
    {
      "id": "1r48ef1",
      "title": "your brain fog has a pattern you probably haven't caught yet",
      "subreddit": "BrainFog",
      "score": 25,
      "numComments": 8,
      "createdUtc": 1771035492,
      "selftext": "most people describe their fog as \"constant\" or \"random\" but when you actually start logging timestamps, what you ate, sleep the night before - almost everyone has triggers they're not seeing. took me weeks of tracking before I caught mine and it wasn't what I expected at all\n\nthe shitty catch-22 is fog degrades pattern recogntion first. so you're trying to spot trends using the exact cognitive function that's most fucked. most people just default to \"it's always there\" when there's usually something driving it\n\neven basic tracking works. notes app w/ timestamps, rate your fog 1-10 a few times a day, jot what you ate. doesn't need to be fancy. the patterns that matter tend to be pretty obvious once you have 2-3 weeks of data sitting in front of you\n\nanyone here tracked theirs systematically? curious what patterns showed up that you wouldn't have caught just going by feel",
      "permalink": "/r/BrainFog/comments/1r48ef1/your_brain_fog_has_a_pattern_you_probably_havent/",
      "mentionsSoma": false
    },
    {
      "id": "1r3yefd",
      "title": "your \"energy levels\" aren't a real metric",
      "subreddit": "HubermanLab",
      "score": 7,
      "numComments": 10,
      "createdUtc": 1771010438,
      "selftext": "I say this as someone w/ a phd in neuroscience who is also guilty of it. we all run these self experiments, try a new stack for 3 weeks, and the main data point is \"yeah I feel pretty good.\" if anyone submitted that as a study it'd get rejected in like 4 seconds lol\n\nthe thing that got me thinking about this is I realized stimulants can make you feel cognitively sharper while your actual working memory stays flat or even gets worse. and sleep debt does the opposite, you feel totally fine while your reaction time has gone to shit. so \"I feel more energized\" is genuinely unreliable as a signal\n\nnot trying to be a buzzkill about it, I just think even adding one objective measure (reaction time tests, working memory tasks, whatever) on top of the vibes tracking would make everyones self-experimenting so much more useful. we're already doing the hard part by experimenting, might as well get real data from it\n\n  \nhave my own methods but would love to hear what others are using for this kind of tracking",
      "permalink": "/r/HubermanLab/comments/1r3yefd/your_energy_levels_arent_a_real_metric/",
      "mentionsSoma": false
    },
    {
      "id": "1r28jda",
      "title": "the gap between feeling productive and being productive is way bigger than you think",
      "subreddit": "getdisciplined",
      "score": 8,
      "numComments": 9,
      "createdUtc": 1770841521,
      "selftext": "something that fucked me up last year - I started actually timing my deep work instead of just tracking whether I \"worked\" that day. on my busiest days, tons of context switching, emails, checking stuff off lists, I'd rate myself like 8/10 productive. on days where I sat with one hard problem for hours and felt like I barely moved, I'd rate myself maybe 4/10\n\nturns out those slow days were producing almost all my actual output. the busy days felt great but I was basically just doing easy shit fast\n\nand it makes sense if you think about it neurologically bc real cognitive work is uncomfortable and your brain resists it. so that feeling of \"crushing it\" while you fly through your todo list is probably a sign you're not actually pushing your brain at all\n\nthe discipline community is so obsessed w tracking inputs like wake up time, gym sessions, hours studied. but nobody tracks whether their brain is actually performing better as a result. I started messing around w reaction time tests, working memory stuff, some cognitive tracking tools I'm tinkering w on the side, and the gap between how productive I felt vs how my brain was actually doing was way bigger than I expected\n\nis anyone here measuring cognitive output at all or just counting habits?",
      "permalink": "/r/getdisciplined/comments/1r28jda/the_gap_between_feeling_productive_and_being/",
      "mentionsSoma": false
    },
    {
      "id": "1r25c88",
      "title": "Cold Plunge Benefits Vary Wildly Between People and Nobody Talks About Why",
      "subreddit": "coldplunge",
      "score": 40,
      "numComments": 43,
      "createdUtc": 1770834499,
      "selftext": "there's a weird assumption baked into most cold plunge advice that the protocol is the variable that matters - temperature, duration, breathing technique. but the individual variation in cold response is honestly kind of insane and almost nobody's talking about it\n\nyour response is largely determined by stuff you can't willpower your way through - TRPM8 receptor polymorphisms (literally how your body detects cold at the molecular level), baseline sympathetic tone, adrenergic receptor density. some people dump a massive norepinephrine response from 3 mins at 50f, others barely register it at 38f\n\nspent years studying this stuff in grad school and the part that bugs me - the \"just stay consistent and you'll adapt\" advice completley ignores that some people are genuine non-responders. not bc they're weak or doing it wrong, but bc their receptor biology doesn't produce the same downstream cascade\n\nthe real problem is most people aren't measuring whether they're actually getting a cognitive or neurochemical benefit from this shit. going by how you feel after is basically useless bc arousal and alertness mask what's happening at the functional level\n\nfor those of you who are actually tracking cognitive performance around your plunges - what are you using and what patterns are you seeing?",
      "permalink": "/r/coldplunge/comments/1r25c88/cold_plunge_benefits_vary_wildly_between_people/",
      "mentionsSoma": false
    },
    {
      "id": "1r1gk7d",
      "title": "You're Probably Misdiagnosing Your Post-Lunch Crash",
      "subreddit": "Biohackers",
      "score": 43,
      "numComments": 12,
      "createdUtc": 1770765301,
      "selftext": "saw someone post about severe fatigue after eating and the comments were all \"check blood sugar\" and \"that's normal just rest.\" neither is completley wrong but both miss the actual mechanism\n\nwhen you eat, blood gets redistributed to your gut for digestion - obvious. what's less obvious is your orexin neurons in the lateral hypothalamus get directly suppressed by rising glucose. orexin is the same system that keeps your prefrontal cortex online for exectuive function and working memory. so it's not \"blood going to stomach\" - your wake/cognition system is literally being turned off by the meal. spent my phd on neural circuits and this shit still fascinates me\n\nthe individual variation here is MASSIVE. two people eat the same lunch, one loses 40% of their working memory capacity for 90 min, the other barely notices. but nobody's measurng the cognitive drop, just going by how sleepy they feel - which correlates poorly w/ actual performance\n\nhas anyone here actually tested their cognitive function pre vs post meal or are we just accepting the crash as inevitable?",
      "permalink": "/r/Biohackers/comments/1r1gk7d/youre_probably_misdiagnosing_your_postlunch_crash/",
      "mentionsSoma": false
    },
    {
      "id": "1qx7dzi",
      "title": "“end on cold” is not the universal rule you think it is",
      "subreddit": "coldplunge",
      "score": 17,
      "numComments": 22,
      "createdUtc": 1770350642,
      "selftext": "the soberg principle gets thrown around like a commandment but most people parroting it don’t understand what it’s actually optimizing for. “ending on cold” forces your body to reheat itself - that’s it. sustained norepinephrine release, brown fat upregulation, metabolic adaptation over time. Soberg’s 2021 paper w/ winter swimmers showed this pretty clearly\n\nbut if you’re doing contrast for recovery or sleep, you’re literally working against yourself. you WANT parasympathetic activation, vasodilation, cortisol coming down. ending on cold fights all of that. I studied neural signaling pathways in grad school and these two pathways are literally pulling in opposite directions. the sramek 2000 paper showed cold at 14c spikes norepinephrine \\~530% - jumping into a sauna after basicaly blunts that entire response before your body uses it. but if you’re chasing recovery that spike is irrelevant anyway bc you want the opposite neurochemistry\n\nI think the people in this sub who are serious about this stuff probably already intuit that the ordering matters differently depending on the goal. the issue is the discourse is just “end on cold” as a blanket rule\n\ncurious if anyone here is actually running n=1 experiments on ordering or if we’re all just going by feel​​​​​​​​​​​​​​​​",
      "permalink": "/r/coldplunge/comments/1qx7dzi/end_on_cold_is_not_the_universal_rule_you_think/",
      "mentionsSoma": false
    },
    {
      "id": "1qqx888",
      "title": "Measure. Your. Discipline.",
      "subreddit": "getdisciplined",
      "score": 25,
      "numComments": 9,
      "createdUtc": 1769752490,
      "selftext": "Last year I realized I'd been grinding on self improvement for like 3 years and had absolutely no idea if I was actually getting better at anything.\n\nI was doing all the discipline stuff - consistent sleep schedule, morning routine, exercise, cutting distractions. Some days I felt amazing and sharp, other days felt like complete brain fog. I'd just assume the routine was working on good days and something was wrong on bad days\n\nThe worst part was how confident I felt about what was helping vs hurting. I'd add some new habit and feel more focused that week, so obviously it was working right? Or I'd have a shit week and immediately blame whatever I changed last. I was optimizing based entirely on vibes and mood\n\nI finally started tracking things objectively bc I couldn't take the uncertainty anymore. I come from a neuroscience research background so the idea of changing variables without measuring data already felt insane.\n\nHere's what actually changed things:\n\n1 - Tracked time in actual deep work vs time feeling busy. Used a simple timer, nothing fancy. Turns out I was \"productive\" for maybe 2 hours a day even on days I felt like I crushed it. That one stung\n\n2 - I measured my cognitive performance directly. Reaction time tests, working memory benchmarks, even built some tools to do real cognitive tracking. Some habits I swore by did literally nothing when tested, other small things I almost dropped were the only ones that moved the needle.\n\n3 - Started tracking output and NOT input. Stopped caring about \"I worked out 5x this week\" and focused on \"I finished X meaningful tasks.\" Discipline for its own sake is pointless if it doesn't translate to actual results.\n\nAt first tracking everything felt obsessive and annoying as hell. Like turning my life into a spreadsheet. But slowly it became clear which things actually mattered vs which just felt productive.\n\nI'm not perfect about it now. Most days I still go by feel. But having those baselines completely changed how I approach this stuff. I was working really hard on things that didn't matter and ignoring what actually improved performance\n\nThe uncomfortable truth is your brain is terrible at self assessment. Asking yourself \"am I getting better\" when your cognitive function is the thing you're trying to improve is like asking a broken scale if it's accurate\n\nAnyway that's what worked for me. Sounds obsessive when I write it out but it beats another 3 years of guessing!",
      "permalink": "/r/getdisciplined/comments/1qqx888/measure_your_discipline/",
      "mentionsSoma": false
    },
    {
      "id": "1qovm80",
      "title": "Stop \"Optimizing\" Your Stack Until You Know What's Actually Broken",
      "subreddit": "Biohackers",
      "score": 50,
      "numComments": 33,
      "createdUtc": 1769559434,
      "selftext": "phd in comp neuro here. honestly the thing that drives me crazy about biohacking is everyone's optimizing stacks without measuring what's actually broken in the first place\n\nbrain fog, low motivation, poor focus - these can come from COMPLETELY different neural mechanisms. cholinergic deficit in prefrontal cortex, dopaminergic insuffiency in striatum, GABAergic overactivation flattening reward circuits, neuroinflammation messing w/ synaptic transmission\n\nbut people just pick supplements based on reddit threads. ashwagandha bc you're stressed (is your cortisol actually high tho?), alpha-gpc bc you can't focus (acetylcholine issue or something else?), modafinil bc you're tired (what if dopamine receptors are already downregulated?)\n\ntaking the wrong modulator doesn't just \"not work\", it makes shit worse. overactive GABA when you needed dopamine, more glutamate when you had excitotoxicity, suppressing systems that're already suppressed\n\n\n\ncurious: anyone tracking objective cognitive markers before changing their stack? or just running blind experiments w/ zero baseline",
      "permalink": "/r/Biohackers/comments/1qovm80/stop_optimizing_your_stack_until_you_know_whats/",
      "mentionsSoma": false
    },
    {
      "id": "1qottmu",
      "title": "Cold Plunging Probably Works But Not for the Reasons Everyone Thinks",
      "subreddit": "coldplunge",
      "score": 75,
      "numComments": 29,
      "createdUtc": 1769555128,
      "selftext": "the \"250% dopamine increase\" thing huberman always talks about has become gospel in this community but I think it's actualy burying the more interesting finding\n\nthat stat comes from a 2000 czech study (sramek et al) where subjects sat in 14c water for an hour. the dopamine increase was 250% sure, but norepinephrine went up 530%. thats more than double the dopamine effect and norepinephrine is way more directly tied to the alertness, focus, and mood shift people actualy report feeling after a plunge\n\ndopamine gets all the attention because its the \"feel good molecule\" and thats an easy sell. but the acute mental clarity and that sort of calm-but-activated state people describe? thats norepinephrine. its what makes you feel locked in without feeling wired. honestly the dopamine framing is kind of bullshit marketing at this point\n\nthe other thing nobody mentions is that study mesured plasma levels, meaning whats circulating in blood, not whats happening in your brain. those arent the same system. the subjective experience might be driven by completely different mechanisms we're not even measuring\n\nI did my phd in computational neuroscience and one thing that always bugged me about the cold plunge discourse is how much we've latched onto one number from one study and built an entire narative around it. the effect is probably real but we're confidently explaining it with the wrong damn molecule\n\ncurious if anyone else has noticed the norepinephrine thing or if everyones just vibing with the dopamine framing",
      "permalink": "/r/coldplunge/comments/1qottmu/cold_plunging_probably_works_but_not_for_the/",
      "mentionsSoma": false
    },
    {
      "id": "1qo9cdx",
      "title": "Brain Fog Compounds Like Hell",
      "subreddit": "BrainFog",
      "score": 11,
      "numComments": 4,
      "createdUtc": 1769506571,
      "selftext": "had a shit day bc my brain was slow, so tasks took twice as long. less time meant less sleep. worse sleep meant worse cognition the next day. repeat until completely fucked\n\nimpaired cognition -> slower work -> less recovery -> worse cognition -> even slower -> it just keeps going\n\nthe worst part is recognizing you're in the loop requires pattern recognition, which is exactly what's impaired when you're foggy. I didn't notice for months, kept thinking \"just need to push through this week\" but the deficit kept accumulating\n\nbreaking it meant actually stopping, not just \"resting better\" but genuinely reducing cognitive load until I could recover. nearly impossible when responsibilities pile up and your impaired brain keeps saying you're fine\n\nhas anyone else gotten stuck in this? what actually worked to break the cycle?",
      "permalink": "/r/BrainFog/comments/1qo9cdx/brain_fog_compounds_like_hell/",
      "mentionsSoma": false
    },
    {
      "id": "1qo95hn",
      "title": "I stopped optimizing my productivity",
      "subreddit": "productivity",
      "score": 1,
      "numComments": 1,
      "createdUtc": 1769505876,
      "selftext": "[removed]",
      "permalink": "/r/productivity/comments/1qo95hn/i_stopped_optimizing_my_productivity/",
      "mentionsSoma": false
    },
    {
      "id": "1qlflqc",
      "title": "Everyone's Injecting BPC-157 But Ignoring Natural Peptides??",
      "subreddit": "NootropicsHelp",
      "score": 1,
      "numComments": 0,
      "createdUtc": 1769236205,
      "selftext": "",
      "permalink": "/r/NootropicsHelp/comments/1qlflqc/everyones_injecting_bpc157_but_ignoring_natural/",
      "mentionsSoma": false
    },
    {
      "id": "1qlflbm",
      "title": "Everyone's Injecting BPC-157 But Ignoring Natural Peptides??",
      "subreddit": "HubermanLab",
      "score": 18,
      "numComments": 17,
      "createdUtc": 1769236167,
      "selftext": "Everyone's injecting bpc157 and growth hormone peptides but nobody talks about the endogenous peptides your brain produces that actually regulate cognition. I'm talking about orexin, neuropeptide y, bdnf signaling peptides - these directly impact memory consolidation, attention, cognitive load tolerance\n\nI did my phd studying neural circuits and one thing that always struck me is how obsessed biohackers are with adding exogenous compounds when they have zero idea whats happening with their endogenous systems. like youre injecting peptides to \"optimize\" but you dont even know if your brains baseline peptide signaling is functioning properly\n\nheres what actually matters for cognitive performance:\n\norexin/hypocretin - regulates wakefulness and attention. when this system is off you get that brain fog feeling even with perfect sleep. low orexin = cognitive fatigue that no amount of coffee fixes\n\nnpy (neuropeptide y) - modulates stress response and memory under pressure. this is why some people can think clearly during high stress and others completely fall apart cognitively\n\nbdnf and its signaling cascade - everyone knows bdnf for neuroplasticity but the peptide fragments that come from bdnf processing are what actually matter for real-time cognitive function. exercise boosts bdnf but if downstream signaling is broken you dont get the cognitive benefits\n\nthe problem is we have no good way to track these in real time. bloodwork gives you a snapshot but doesnt show you how your brain peptide systems respond to stress, sleep debt, cognitive load throughout the day. so people just... guess? and then throw exogenous peptides at problems they havent even identified\n\nhuberman talked about this indirectly in his peptide episode when he mentioned pleiotropic effects, these compounds hit multiple pathways and we dont really know what theyre doing in your specific system. but he didnt go deep enough on the fact that your endogenous peptide systems are probably the actual bottleneck\n\nfrom my research perspective the future isnt \"what peptide should I inject\" its \"how do I measure whats actually broken in my cognitive signaling and address that specifically\". injection without measurement is just expensive guessing\n\ncurious if anyone here has actually tracked cognitive performance objectively (not just how you feel) before and after peptide protocols. like actual working memory tests, processing speed, sustained attention tasks. because subjective improvement ≠ actual cognitive improvement and thats the gap nobody talks about",
      "permalink": "/r/HubermanLab/comments/1qlflbm/everyones_injecting_bpc157_but_ignoring_natural/",
      "mentionsSoma": false
    },
    {
      "id": "1q7ugpr",
      "title": "Oura Ring Delivered",
      "subreddit": "ouraring",
      "score": 1,
      "numComments": 7,
      "createdUtc": 1767921699,
      "selftext": "Just got my Oura Ring in the mail. The deal was too good to miss out on ($100 christmas + $200 amex off).\n\nWoke up with it today for the first time and saw a readiness score of 90 and immediately felt like I was gonna conquer the day. \n\nI was wondering how much of these scores have a psychological impact? I feel like if I saw a 40 and I had XYZ to do in the day, I would approach my day with no motivation whatsoever to do those tasks. As compared to just waking up with the same rest (but without the ring/scores), I wouldn't feel as torn to complete XYZ.\n\nAlso, what are some scores that you guys find interesting that I should look out for?\n\nhttps://preview.redd.it/oa6vtyos68cg1.png?width=912&format=png&auto=webp&s=e47530975694153b910447b4fb137947e73504c9\n\n  \n",
      "permalink": "/r/ouraring/comments/1q7ugpr/oura_ring_delivered/",
      "mentionsSoma": false
    },
    {
      "id": "1nfh9r6",
      "title": "Sign up to try a cognitive fitness tracker!",
      "subreddit": "BrainFog",
      "score": 1,
      "numComments": 0,
      "createdUtc": 1757717012,
      "selftext": "[removed]",
      "permalink": "/r/BrainFog/comments/1nfh9r6/sign_up_to_try_a_cognitive_fitness_tracker/",
      "mentionsSoma": false
    },
    {
      "id": "1nfh2xz",
      "title": "[ Removed by moderator ]",
      "subreddit": "neuro",
      "score": 0,
      "numComments": 1,
      "createdUtc": 1757716538,
      "selftext": "[removed]",
      "permalink": "/r/neuro/comments/1nfh2xz/ever_wanted_to_measure_your_mind/",
      "mentionsSoma": false
    },
    {
      "id": "1nfh2j7",
      "title": "[ Removed by moderator ]",
      "subreddit": "cognitiveTesting",
      "score": 2,
      "numComments": 2,
      "createdUtc": 1757716509,
      "selftext": "[removed]",
      "permalink": "/r/cognitiveTesting/comments/1nfh2j7/sign_up_to_measure_your_mind/",
      "mentionsSoma": false
    },
    {
      "id": "1nfh1vi",
      "title": "[ Removed by moderator ]",
      "subreddit": "Biohackers",
      "score": 4,
      "numComments": 1,
      "createdUtc": 1757716463,
      "selftext": "[removed]",
      "permalink": "/r/Biohackers/comments/1nfh1vi/sign_up_to_track_your_cognitive_health/",
      "mentionsSoma": false
    },
    {
      "id": "1n9hc4o",
      "title": "How do you guys think about cognitive fitness tracking?",
      "subreddit": "QuantifiedSelf",
      "score": 0,
      "numComments": 9,
      "createdUtc": 1757107055,
      "selftext": "Hey everyone - I'm a neuroscience PhD working on building a continuous cognitive fitness tracker. I want to better understand how people in the QS community think about cognitive health and brain performance tracking, so would love your input into this survey! [https://form.typeform.com/to/ktXH0VCr](https://form.typeform.com/to/ktXH0VCr) ",
      "permalink": "/r/QuantifiedSelf/comments/1n9hc4o/how_do_you_guys_think_about_cognitive_fitness/",
      "mentionsSoma": false
    },
    {
      "id": "1mjgt54",
      "title": "What do you guys look for in the data and how do you organize it?",
      "subreddit": "QuantifiedSelf",
      "score": 4,
      "numComments": 7,
      "createdUtc": 1754514616,
      "selftext": "I've had a garmin for years though have never really looked at my data over time. I mainly just check my sleep score and sometimes HRV. I'm now considering a CGM and my friend just gave me his oura ring, so I want to see if I can put all of these pieces together and really build out a stack. I'm curious what sorts of insights you guys look for if you track different health - are you looking for specific patterns across the data or just seeing how things change over longer periods of time? And how you guys like to organize your data? ",
      "permalink": "/r/QuantifiedSelf/comments/1mjgt54/what_do_you_guys_look_for_in_the_data_and_how_do/",
      "mentionsSoma": false
    },
    {
      "id": "1mde76r",
      "title": "What keeps you disciplined?",
      "subreddit": "HubermanLab",
      "score": 1,
      "numComments": 1,
      "createdUtc": 1753899634,
      "selftext": "I've been learning a lot more about the health habits that now seem to be increasingly popular so want to get into it for myself. Maybe an amateur problem, but I'm very bad at consistency. What keeps you guys motivated to make sure you get the perfect amount of sunlight, or take the right types of supplements every day, or do your cold plunge and not get lazy? I know some fitness trackers help gamify it for people, but any other tricks? Help a newbie out here...",
      "permalink": "/r/HubermanLab/comments/1mde76r/what_keeps_you_disciplined/",
      "mentionsSoma": false
    },
    {
      "id": "1mde1kv",
      "title": "What are the most salient effects of cold plunge?",
      "subreddit": "coldplunge",
      "score": 12,
      "numComments": 33,
      "createdUtc": 1753899276,
      "selftext": "It seems like everyone here are cold plunge enthusiasts, so what are the most immediate effects that you guys feel? Is it physical or mental? ",
      "permalink": "/r/coldplunge/comments/1mde1kv/what_are_the_most_salient_effects_of_cold_plunge/",
      "mentionsSoma": false
    },
    {
      "id": "1mddzpp",
      "title": "Do you guys measure brain fog or mental clarity?",
      "subreddit": "QuantifiedSelf",
      "score": 13,
      "numComments": 27,
      "createdUtc": 1753899156,
      "selftext": "I hear a lot of people talk about brain fog these days, from covid, burnout, poor sleep etc. Have you guys found ways to track this? Some days I'm definitely more aware that I'm fatigued or slow, but I'm sure that also fluctuates and I only feel it when it's the most obviously severe... ",
      "permalink": "/r/QuantifiedSelf/comments/1mddzpp/do_you_guys_measure_brain_fog_or_mental_clarity/",
      "mentionsSoma": false
    },
    {
      "id": "1mddoyk",
      "title": "Do you care more about the baseline or the day-to-day numbers?",
      "subreddit": "ouraring",
      "score": 2,
      "numComments": 2,
      "createdUtc": 1753898480,
      "selftext": "Hi everyone - I'm considering getting a subcription to an older oura ring that someone passed to me. But I noticed that a lot of the baselines take a long time to establish. Is there really any truth to these baselines? How helpful are they versus just seeing your sleep scoring each morning? ",
      "permalink": "/r/ouraring/comments/1mddoyk/do_you_care_more_about_the_baseline_or_the/",
      "mentionsSoma": false
    },
    {
      "id": "1mciuen",
      "title": "What Whoop scores do you pay most attention to and why?",
      "subreddit": "whoop",
      "score": 11,
      "numComments": 19,
      "createdUtc": 1753812525,
      "selftext": "Thinking about getting one and curious about what people use Whoop the most for. I've heard of the Whoop age but I'm guessing that doesn't fluctuate too often? ",
      "permalink": "/r/whoop/comments/1mciuen/what_whoop_scores_do_you_pay_most_attention_to/",
      "mentionsSoma": false
    },
    {
      "id": "1mciof8",
      "title": "New to cognitive testing",
      "subreddit": "cognitiveTesting",
      "score": 3,
      "numComments": 4,
      "createdUtc": 1753812154,
      "selftext": "Hi guys! Been following this r/ for a bit, and curious to try for myself. What aspects of cognition do you all find the most interesting or important to test for? And do you guys have recommendations on which tests to take? ",
      "permalink": "/r/cognitiveTesting/comments/1mciof8/new_to_cognitive_testing/",
      "mentionsSoma": false
    },
    {
      "id": "1j8aprm",
      "title": "Tracking brain + cognitive functions",
      "subreddit": "blueprint_",
      "score": 0,
      "numComments": 0,
      "createdUtc": 1741644001,
      "selftext": "[removed]",
      "permalink": "/r/blueprint_/comments/1j8aprm/tracking_brain_cognitive_functions/",
      "mentionsSoma": false
    },
    {
      "id": "1j647af",
      "title": "Tracking mental acuity and cognitive performance",
      "subreddit": "biohackhers",
      "score": 1,
      "numComments": 0,
      "createdUtc": 1741392165,
      "selftext": "Hi everyone! Would love your guys' input on something I'm working on. Think of it as a \"Strava for Cognition\" - essentially using voice analysis to measure mental acuity, cognitive stress, speech clarity, and more. We want to provide people with a more continuous and objective way to measure cognitive changes and relate it back to other health trends + lifestyle habits. For women, this is especially relevant for cognitive changes during menstrual cycles, menopause, migraines, etc.   \n  \nWe're looking for early users to test and help shape the product. Would love to get more women signed up for feedback, drop your contact here if you're interested!  [https://airtable.com/appczl6TRhOwcUBKu/pagz9QaSGqFqK9evY/form](https://airtable.com/appczl6TRhOwcUBKu/pagz9QaSGqFqK9evY/form)",
      "permalink": "/r/biohackhers/comments/1j647af/tracking_mental_acuity_and_cognitive_performance/",
      "mentionsSoma": false
    },
    {
      "id": "1j642es",
      "title": "[ Removed by moderator ]",
      "subreddit": "Biohacking",
      "score": 1,
      "numComments": 0,
      "createdUtc": 1741391793,
      "selftext": "[removed]",
      "permalink": "/r/Biohacking/comments/1j642es/tracking_mental_acuity_and_cognitive_performance/",
      "mentionsSoma": false
    },
    {
      "id": "1j62te7",
      "title": "Looking for feedback on my neuro project (voice AI for cognition)",
      "subreddit": "neuro",
      "score": 2,
      "numComments": 0,
      "createdUtc": 1741388253,
      "selftext": "Hi everyone! I'm working on an early stage neurotech project, think of it as a \"Strava for cognition.\" We're using voice AI to provide insights on mental acuity, cognitive stress, speech fluency, etc. We're looking for early users to test and shape the product, if you're interested feel free to drop your contact: [https://airtable.com/appczl6TRhOwcUBKu/pagz9QaSGqFqK9evY/form](https://airtable.com/appczl6TRhOwcUBKu/pagz9QaSGqFqK9evY/form)\n\nWould welcome any questions/feedback here too!!",
      "permalink": "/r/neuro/comments/1j62te7/looking_for_feedback_on_my_neuro_project_voice_ai/",
      "mentionsSoma": false
    },
    {
      "id": "1j62j0g",
      "title": "Tracking cognitive health",
      "subreddit": "longevity_protocol",
      "score": 1,
      "numComments": 2,
      "createdUtc": 1741387469,
      "selftext": "Hi everyone! Would love your guys' input on something I'm working on. Think of it as a \"Strava for Cognition\" - essentially using voice analysis to measure mental acuity, cognitive stress, speech clarity, and more. We want to provide people with a more continuous and objective way to measure cognitive changes and relate it back to other health trends + lifestyle habits. We're looking for early users to test and help shape the product. Sign up here if you're interested! [https://airtable.com/appczl6TRhOwcUBKu/pagz9QaSGqFqK9evY/form](https://airtable.com/appczl6TRhOwcUBKu/pagz9QaSGqFqK9evY/form)\n\nWelcome any thoughts/suggestions on this and how you would use it!",
      "permalink": "/r/longevity_protocol/comments/1j62j0g/tracking_cognitive_health/",
      "mentionsSoma": false
    },
    {
      "id": "1j62127",
      "title": "Tracking cognitive performance - neurotech software",
      "subreddit": "neurallace",
      "score": 4,
      "numComments": 0,
      "createdUtc": 1741386099,
      "selftext": "Hi everyone! I'm working on an early stage neurotech company, think of it as a \"Strava for cognition.\" We're using voice AI to provide insights on mental acuity, cognitive stress, speech fluency, etc. We're looking for early users to test and shape the product, if you're interested feel free to drop your contact: [https://airtable.com/appczl6TRhOwcUBKu/pagz9QaSGqFqK9evY/form](https://airtable.com/appczl6TRhOwcUBKu/pagz9QaSGqFqK9evY/form)\n\nAny questions/feedback welcome! ",
      "permalink": "/r/neurallace/comments/1j62127/tracking_cognitive_performance_neurotech_software/",
      "mentionsSoma": false
    },
    {
      "id": "1j61y93",
      "title": "UI/UX advice for d2c software product / where can I look for a designer?",
      "subreddit": "UXDesign",
      "score": 1,
      "numComments": 1,
      "createdUtc": 1741385891,
      "selftext": "[removed]",
      "permalink": "/r/UXDesign/comments/1j61y93/uiux_advice_for_d2c_software_product_where_can_i/",
      "mentionsSoma": false
    },
    {
      "id": "1j61hmr",
      "title": "Continuously track cognitive performance",
      "subreddit": "cognitiveTesting",
      "score": 1,
      "numComments": 0,
      "createdUtc": 1741384703,
      "selftext": "Hi everyone! Would love your guys' input on something I'm working on. Think of it as a \"Strava for Cognition\" - essentially using voice analysis to measure mental sharpness, cognitive stress, speech & verbal clarity, and more. We're looking for early users to test and help shape the product. Sign up here if you're interested! [https://airtable.com/appczl6TRhOwcUBKu/pagz9QaSGqFqK9evY/form](https://airtable.com/appczl6TRhOwcUBKu/pagz9QaSGqFqK9evY/form)\n\nWould also welcome any thoughts/suggestions on this and how you would use it!",
      "permalink": "/r/cognitiveTesting/comments/1j61hmr/continuously_track_cognitive_performance/",
      "mentionsSoma": false
    },
    {
      "id": "1j54zsk",
      "title": "Tracking mental acuity and cognitive performance",
      "subreddit": "QuantifiedSelf",
      "score": 9,
      "numComments": 2,
      "createdUtc": 1741292355,
      "selftext": "Hi everyone! Would love your guys' input on something I'm working on. Think of it as a \"Strava for Cognition\" - essentially using voice analysis to measure mental acuity, cognitive stress, speech clarity, and more. We want to provide people with a more continuous and objective way to measure cognitive changes and relate it back to other health trends + lifestyle habits. We're looking for early users to test and help shape the product. Sign up here if you're interested! [https://airtable.com/appczl6TRhOwcUBKu/pagz9QaSGqFqK9evY/form](https://airtable.com/appczl6TRhOwcUBKu/pagz9QaSGqFqK9evY/form)\n\nWould also welcome any thoughts/suggestions on this and how you would use it!",
      "permalink": "/r/QuantifiedSelf/comments/1j54zsk/tracking_mental_acuity_and_cognitive_performance/",
      "mentionsSoma": false
    },
    {
      "id": "1j4hyka",
      "title": "Track and optimize your cognitive performance",
      "subreddit": "whoop",
      "score": 1,
      "numComments": 0,
      "createdUtc": 1741218820,
      "selftext": "Hi everyone, I’m building a “Strava for cognition,” a speech-based tool to provide real-time insights and long-term trends on your mental acuity, cognitive fatigue and recovery, communications fluency, peak performance windows, and more. We track our workouts, sleep, and HRV—but what about cognitive performance? Our tech is inspired by the latest neuroscience & voice biomarkers research, helping individuals better understand their cognitive function and cognitive health.\n\nWe’re looking for early testers to help shape this technology—if you're interested or want to learn more, sign up here:\n\n[https://airtable.com/appczl6TRhOwcUBKu/pagz9QaSGqFqK9evY/form](https://airtable.com/appczl6TRhOwcUBKu/pagz9QaSGqFqK9evY/form)\n\nWould love to hear your thoughts - how would you use a tool like this?",
      "permalink": "/r/whoop/comments/1j4hyka/track_and_optimize_your_cognitive_performance/",
      "mentionsSoma": false
    },
    {
      "id": "1j4hxv1",
      "title": "Track and optimize your cognitive function",
      "subreddit": "whoop",
      "score": 0,
      "numComments": 0,
      "createdUtc": 1741218740,
      "selftext": "Hi everyone, I’m building a “Strava for cognition,” a speech-based tool to provide real-time insights and long-term trends on your mental acuity, cognitive fatigue and recovery, communications fluency, peak performance windows, and more. We track our workouts, sleep, and HRV—but what about cognitive performance? Our tech is inspired by the latest neuroscience & voice biomarkers research, helping individuals better understand their cognitive function and cognitive health.\n\nWe’re looking for early testers to help shape this technology—if you're interested or want to learn more, sign up here:\n\n[https://airtable.com/appczl6TRhOwcUBKu/pagz9QaSGqFqK9evY/form](https://airtable.com/appczl6TRhOwcUBKu/pagz9QaSGqFqK9evY/form)\n\nWould love to hear your thoughts - how would you use a tool like this?",
      "permalink": "/r/whoop/comments/1j4hxv1/track_and_optimize_your_cognitive_function/",
      "mentionsSoma": false
    },
    {
      "id": "1j46dc2",
      "title": "Track & Optimize Your Cognitive Function",
      "subreddit": "HubermanLab",
      "score": 5,
      "numComments": 1,
      "createdUtc": 1741190439,
      "selftext": "Hi everyone, I’m building a “Strava for cognition,” a speech-based tool to provide real-time insights and long-term trends on your mental acuity, cognitive fatigue and recovery, communications fluency, peak performance windows, and more. We track our workouts, sleep, and HRV—but what about cognitive performance? We’re inspired by the latest neuroscience & voice biomarkers research, and helping individuals better understand their cognitive function and cognitive health.\n\nWe’re looking for early testers to help shape this technology—if you're interested or want to learn more, sign up here:\n\n[https://airtable.com/appczl6TRhOwcUBKu/pagz9QaSGqFqK9evY/form](https://airtable.com/appczl6TRhOwcUBKu/pagz9QaSGqFqK9evY/form)\n\nWould love to hear your thoughts - how would you use a tool like this?",
      "permalink": "/r/HubermanLab/comments/1j46dc2/track_optimize_your_cognitive_function/",
      "mentionsSoma": false
    },
    {
      "id": "1j46cwv",
      "title": "Track your cognitive changes continuously over time",
      "subreddit": "migraine",
      "score": 3,
      "numComments": 0,
      "createdUtc": 1741190413,
      "selftext": "Hi everyone, given migraines are extremely disruptive for our ability to work and stay productive or even feel cognitively stable, we’re building a speech-based tool to help people track these fluctuations and what factors lead to better recovery. Think “Strava for cognition”—we’re leveraging the latest neuroscience & voice biomarkers research to objectively measure mental clarity, brain fog, and cognitive changes over time.\n\nWe’re looking for early users to try it out. If you’re interested, drop your contact here: [https://airtable.com/appczl6TRhOwcUBKu/pagz9QaSGqFqK9evY/form](https://airtable.com/appczl6TRhOwcUBKu/pagz9QaSGqFqK9evY/form)",
      "permalink": "/r/migraine/comments/1j46cwv/track_your_cognitive_changes_continuously_over/",
      "mentionsSoma": false
    },
    {
      "id": "1iz1lol",
      "title": "Cognitive function tracking",
      "subreddit": "migraine",
      "score": 18,
      "numComments": 7,
      "createdUtc": 1740612572,
      "selftext": "**Would you be interested in measuring your cognitive function continuously (similar to how we can measure heart rate, sleep etc.)?** For example, seeing metrics on your engagement, mental sharpness, speech clarity, cognitive stress, attention, memory etc. throughout a work day and over time. Migraines really affect my productivity so curious what other people think. (upvote = yes, downvote = no). ",
      "permalink": "/r/migraine/comments/1iz1lol/cognitive_function_tracking/",
      "mentionsSoma": false
    },
    {
      "id": "1iz196b",
      "title": "Cognitive performance tracking",
      "subreddit": "HubermanLab",
      "score": 2,
      "numComments": 2,
      "createdUtc": 1740611626,
      "selftext": "**Would you be interested in measuring your cognitive function continuously (similar to how we can measure heart rate, sleep etc.)?** \n\n  \nFor example, seeing metrics on your engagement, mental sharpness, speech clarity, cognitive stress, attention, memory etc. throughout a work day and over time. \n\n[View Poll](https://www.reddit.com/poll/1iz196b)",
      "permalink": "/r/HubermanLab/comments/1iz196b/cognitive_performance_tracking/",
      "mentionsSoma": false
    },
    {
      "id": "1hkh7wv",
      "title": "Anyone who wants to understand their brain health through aggregated health data over time?",
      "subreddit": "Biohackers",
      "score": 0,
      "numComments": 2,
      "createdUtc": 1734932663,
      "selftext": "I’m building a personalized platform for brain health and we’re offering a concierge service (human-in-the-loop AI) to help you track different factors that affect your mood, productivity, focus, memory, and overall neuro-wellbeing. We’re two Oxford PhDs in computational neuroscience and healthcare AI, and looking for early adopters of our product. Use [this link](https://airtable.com/appu8UOAkT9WMr65g/pag7XjpTCxBNLKksn/form) to sign up or follow along our journey, and feel free to comment below/DM with any questions or input! ",
      "permalink": "/r/Biohackers/comments/1hkh7wv/anyone_who_wants_to_understand_their_brain_health/",
      "mentionsSoma": false
    },
    {
      "id": "1hgiew8",
      "title": "Migraine apps/tools?",
      "subreddit": "migraine",
      "score": 9,
      "numComments": 23,
      "createdUtc": 1734463151,
      "selftext": "hi everyone - are mobile apps helpful for managing migraines? // any suggestions for good ones to track symptoms or manage migraines? and has anyone ever tried tracking triggers, etc. with a smart watch (i.e. garmin/apple)? trying to find new tools to help myself.. (would be extra helpful if you explain how you use the apps i.e. what does it do, how does it help/not help etc.) ",
      "permalink": "/r/migraine/comments/1hgiew8/migraine_appstools/",
      "mentionsSoma": false
    }
  ],
  "comments": [
    {
      "id": "o652hu8",
      "subreddit": "HubermanLab",
      "score": 1,
      "body": "yeah thats a good way to put it. the implied message is \"do all these protocols and you'll be optimized\" but nobody talks about how some of those protocols might be working against each other depending on your baseline state",
      "createdUtc": 1771454286,
      "linkTitle": "Neuroplasticity Isn't Always Good",
      "permalink": "/r/HubermanLab/comments/1r6rbkg/neuroplasticity_isnt_always_good/o652hu8/",
      "mentionsSoma": false
    },
    {
      "id": "o652gdk",
      "subreddit": "HubermanLab",
      "score": 1,
      "body": "yeah - merzenich's \"soft wired\" is probably the best accessible book on this. for the maladaptive side specifically, look into doidge's \"the brain that changes itself\" which covers phantom limb pain and chronic pain as maladaptive plasticity examples. on the research side, pascual-leone's work on constraint and plasticity is solid. for the social media/attention angle, gazzaley & rosen \"the distracted mind\" is underrated",
      "createdUtc": 1771454274,
      "linkTitle": "Neuroplasticity Isn't Always Good",
      "permalink": "/r/HubermanLab/comments/1r6rbkg/neuroplasticity_isnt_always_good/o652gdk/",
      "mentionsSoma": false
    },
    {
      "id": "o652dmw",
      "subreddit": "HubermanLab",
      "score": 1,
      "body": "psilocybin increases BDNF and promotes dendritic spine growth mainly through 5-HT2A activation, so yes it does enhance plasticity. but thats exactly the point of the post - more plasticity in what direction? if you microdose and then spend the day doomscrolling you're potentially accelerating maladaptive rewiring. the compound doesn't know what you want to reinforce. context and input during the plasticity window matters as much as the plasticity itself",
      "createdUtc": 1771454251,
      "linkTitle": "Neuroplasticity Isn't Always Good",
      "permalink": "/r/HubermanLab/comments/1r6rbkg/neuroplasticity_isnt_always_good/o652dmw/",
      "mentionsSoma": false
    },
    {
      "id": "o652boj",
      "subreddit": "HubermanLab",
      "score": 1,
      "body": "what you're describing is basically your prefrontal cortex losing the argument to your amygdala more often. social media trains fast categorical judgments (threat/reward binary) and that pattern generalizes offline bc the circuits don't know the difference between twitter and real life\n\nthings that actually helped me: dedicated blocks of long form reading (30+ min uninterupted), and deliberately practicing \"third option\" thinking when I catch the binary reaction. but tbh the biggest shift was when I started tracking it objectively instead of just noticing it. reaction time tests, working memory stuff, some cognitive tracking I'm tinkering w (soma-health.co if you're curious) - you can actually see the attention degradation after heavy scroll days vs not. once you see the data the motivation to change gets way more concrete\n\nthe good news is the same plasticity that created the pattern can reverse it. just takes longer to build than to break",
      "createdUtc": 1771454236,
      "linkTitle": "Neuroplasticity Isn't Always Good",
      "permalink": "/r/HubermanLab/comments/1r6rbkg/neuroplasticity_isnt_always_good/o652boj/",
      "mentionsSoma": true
    },
    {
      "id": "o65250z",
      "subreddit": "ouraring",
      "score": 1,
      "body": "it does show up in the data actually - there's a decent amount of research on nocebo effects in self-monitoring. the cortisol response to percieved poor recovery isn't imagined, it's just hard to isolate bc the same people checking anxiously are also the ones w higher baseline stress reactivity. the feedback loop is real but yeah it's not the ring's fault per se, more about the relationship w the data",
      "createdUtc": 1771454180,
      "linkTitle": "The Psychological trap of wearable scores",
      "permalink": "/r/ouraring/comments/1r6r2qc/the_psychological_trap_of_wearable_scores/o65250z/",
      "mentionsSoma": false
    },
    {
      "id": "o6522y1",
      "subreddit": "ouraring",
      "score": 1,
      "body": "honestly delayed checking is the move. I check mine after lunch usually. by then you've already set your day's tone based on how you actually feel instead of what the number tells you to feel. use the data retrospectively - look at weekly trends not daily scores. single night readings have too much noise anyway, the 7 day rolling averages are where the real signal is",
      "createdUtc": 1771454162,
      "linkTitle": "The Psychological trap of wearable scores",
      "permalink": "/r/ouraring/comments/1r6r2qc/the_psychological_trap_of_wearable_scores/o6522y1/",
      "mentionsSoma": false
    },
    {
      "id": "o65215g",
      "subreddit": "ouraring",
      "score": 1,
      "body": "fair question - the half life of cortisol itself is only like 60-90 min but the downstream effects on HPA axis sensitization last way longer. one acute morning spike isn't gonna wreck you, but if you're doing it every single morning you're basically training a lower threshold for cortisol reactivity throughout the day. thats what shows up in overnight HRV, not the single spike but the cumulative sympathetic tone from repeated activation",
      "createdUtc": 1771454147,
      "linkTitle": "The Psychological trap of wearable scores",
      "permalink": "/r/ouraring/comments/1r6r2qc/the_psychological_trap_of_wearable_scores/o65215g/",
      "mentionsSoma": false
    },
    {
      "id": "o651xew",
      "subreddit": "ouraring",
      "score": 1,
      "body": "this is the thing that bugs me about the current wearable stack tbh. oura is measuring your body's recovery but it's not measuring your brain's actual output. you can have perfect HRV and still have shit cognitive function bc of inflammation, blood sugar crashes, cortisol patterns that don't show up in overnight metrics\n\nI've been looking into this a lot from the research side - theres a whole layer of cognitive readiness that sleep scores just don't capture. been messing around w some cognitive tracking tools on the side (a thing I'm building at soma-health.co) alongside oura and the disconnect is wild sometimes. perfect sleep score, but measurably worse working memory\n\nnot saying ditch the ring but it's fs only half the picture",
      "createdUtc": 1771454117,
      "linkTitle": "The Psychological trap of wearable scores",
      "permalink": "/r/ouraring/comments/1r6r2qc/the_psychological_trap_of_wearable_scores/o651xew/",
      "mentionsSoma": true
    },
    {
      "id": "o64677l",
      "subreddit": "Biohackers",
      "score": 1,
      "body": "this is the kind of shit more people should be doing instead of just \"feeling better\" . the afternoon reaction time gap you're seeing tracks w/ research on mild dehydration impairing prefrontal function before you even feel thirsty, basically your executive function degrades before your body sends a thirst signal\n\nfor the cognitive side I use a mix of humanbenchmark, some working memory tests, and a cognitive tracking tool I've been building (waitlist at soma-health.co if you're curious). biggest thing I learned is test at the same time every day or the data is useless, circadian variation in reaction time alone is like 15-20ms which would totally mask a hydration effect if you're not controlling for it",
      "createdUtc": 1771445258,
      "linkTitle": "Optimizing water intake for performance based on data, tracked 60 days and found ideal amount is way higher than standard",
      "permalink": "/r/Biohackers/comments/1r6xawi/optimizing_water_intake_for_performance_based_on/o64677l/",
      "mentionsSoma": true
    },
    {
      "id": "o645r4l",
      "subreddit": "Biohackers",
      "score": 2,
      "body": "the magnesium thing makes total sense w adderall btw. amphetamines increase dopaminergic drive and magnesium potentiates GABA transmission, so you're basically running excitatory and inhibitory systems against each other. your brain's morning cortisol spike can't cut through the residual GABAergic inhibition and you wake up feeling like shit\n\nthe real problem is everyone in this thread found out by accident. like you skipped a day and felt better, that's great, but imagine if you'd been tracking reaction time or working memory daily, you'd have caught the decline pattern within the first week instead of months later. most people are running blind experiments on their own neurochemistry w zero data and its kinda wild/prob dangerous??",
      "createdUtc": 1771445133,
      "linkTitle": "What supplement did you notice was actually making you feel worse only after you stopped taking it?",
      "permalink": "/r/Biohackers/comments/1r6jm3v/what_supplement_did_you_notice_was_actually/o645r4l/",
      "mentionsSoma": false
    },
    {
      "id": "o6455kf",
      "subreddit": "coldplunge",
      "score": 1,
      "body": "love coming back from work to a cold plunge in the living room",
      "createdUtc": 1771444964,
      "linkTitle": "My converted freezer, yes in my living room.  What do y'all think?",
      "permalink": "/r/coldplunge/comments/1r7py7r/my_converted_freezer_yes_in_my_living_room_what/o6455kf/",
      "mentionsSoma": false
    },
    {
      "id": "o644wd0",
      "subreddit": "coldplunge",
      "score": 1,
      "body": "the numbness and loss of coordination is your peripheral nervous system basically shutting down voluntary motor control to protect core temp. once vasoconstriction hits that hard your extremities lose fine motor function pretty fast\n\nthe shivering for an hour after is actually the more concerning part bc that means your core temp dropped enough to trigger sustained thermogenesis to recover. with ice cubes in a home tub you're probably around 45-50f which is p cold, 16 min at that range is way past what most adapted plungers do\n\n2-3 min is plenty to get the norepinephrine response. longer ≠ better with cold exposure",
      "createdUtc": 1771444892,
      "linkTitle": "15 minute cold plunge in home bathtub with ice cubes — bad idea this time?",
      "permalink": "/r/coldplunge/comments/1r6mee1/15_minute_cold_plunge_in_home_bathtub_with_ice/o644wd0/",
      "mentionsSoma": false
    },
    {
      "id": "o642ot4",
      "subreddit": "Biohackers",
      "score": 1,
      "body": "honestly the easiest starting point is just testing your actual cognitive output, not blood markers. blood panels tell you about metabolic state but nothing about how your brain is actually performing day to day\n\nwhat I'd do: humanbenchmark.com for reaction time + working memory, run it same time every morning for 2 weeks before you change anything. cambridge brain sciences has decent free tests too. I've been tinkering w some cognitive tracking stuff myself (waitlist at soma-health.co if you're curious) but even basic reaction time tests will show you patterns you'd never catch subjectively\n\nthen yeah get a standard metabolic panel, vitamin d, b12, thyroid, fasting insulin. but the cognitive basline is what most people skip and its the part that actually tells you if your interventions are doing anything",
      "createdUtc": 1771444282,
      "linkTitle": "Stop \"Optimizing\" Your Stack Until You Know What's Actually Broken",
      "permalink": "/r/Biohackers/comments/1qovm80/stop_optimizing_your_stack_until_you_know_whats/o642ot4/",
      "mentionsSoma": true
    },
    {
      "id": "o5s5kt1",
      "subreddit": "HubermanLab",
      "score": 1,
      "body": "still waiting on the peer reviewed version of that one",
      "createdUtc": 1771288182,
      "linkTitle": "When is The 5 Girlfriend Protocol Being Released?",
      "permalink": "/r/HubermanLab/comments/1r5gkvs/when_is_the_5_girlfriend_protocol_being_released/o5s5kt1/",
      "mentionsSoma": false
    },
    {
      "id": "o5s5i2y",
      "subreddit": "HubermanLab",
      "score": 1,
      "body": "525 total T is basically meaningless without free T and SHBG. but honestly libido at that level is way more dopaminergic than hormonal - prolactin, dopamine receptor density, cortisol patterns all matter more than a single testosterone snapshot. I'd push hard for a full hormone panel plus thyroid",
      "createdUtc": 1771288155,
      "linkTitle": "Zero libido",
      "permalink": "/r/HubermanLab/comments/1r58b78/zero_libido/o5s5i2y/",
      "mentionsSoma": false
    },
    {
      "id": "o5s54ih",
      "subreddit": "BrainFog",
      "score": 1,
      "body": "sleep timing consistency is huge - your circadian clock gates a ton of neurotransmitter release and if that's shifting around daily your brain is basically never in the right phase at the right time. and the dehydration thing is real, even 1-2% dehydration impairs working memory measurably",
      "createdUtc": 1771288024,
      "linkTitle": "your brain fog has a pattern you probably haven't caught yet",
      "permalink": "/r/BrainFog/comments/1r48ef1/your_brain_fog_has_a_pattern_you_probably_havent/o5s54ih/",
      "mentionsSoma": false
    },
    {
      "id": "o5s51zd",
      "subreddit": "BrainFog",
      "score": 2,
      "body": "it doesn't have to be complicated tbh. even a simple note 3x a day (morning, afternoon, evening) w/ a 1-5 fog rating and what you ate/did takes like 30 seconds. after 2 weeks you start seeing patterns you'd never catch otherwise\n\nthere are also some tools that can help - cambridge brain sciences has free cognitive tests, humanbenchmark.com for reaction time, I'm actually building something for passive daily tracking too (soma-health.co if you want to try the waitlist). but honestly even the notes app method works if you're consistent w/ it",
      "createdUtc": 1771287999,
      "linkTitle": "your brain fog has a pattern you probably haven't caught yet",
      "permalink": "/r/BrainFog/comments/1r48ef1/your_brain_fog_has_a_pattern_you_probably_havent/o5s51zd/",
      "mentionsSoma": true
    },
    {
      "id": "o5s4xmo",
      "subreddit": "BrainFog",
      "score": 1,
      "body": "a few things worth looking into: CoQ10 and creatine both support mitochondrial ATP production and have decent evidence for cognitive function. getting bloodwork for ferritin, B12, and vitamin D is worth it too bc deficiencies in any of those can impair mitochondrial function and show up as exactly this kind of cognitive fatigue during sustained mental effort. if your fog is specifically triggered by reading (high sustained metabolic demand) vs conversation (lower load), that metabolic angle is definately worth ruling out first",
      "createdUtc": 1771287958,
      "linkTitle": "Fog kicks in when reading?",
      "permalink": "/r/BrainFog/comments/1r30mwm/fog_kicks_in_when_reading/o5s4xmo/",
      "mentionsSoma": false
    },
    {
      "id": "o5s4uhu",
      "subreddit": "HubermanLab",
      "score": 1,
      "body": "sleep onset latency is great bc it's one of the few things that's hard to lie to yourself about. if you do another round, reaction time tests are probaly the easiest objective cognitive metric to add - humanbenchmark.com is free, or even something like a daily digit span test. I've been working on a tool that tracks cognitive function from voice patterns which catches stuff reaction time misses (waitlist at soma-health.co if youre interested), but even basic RT + sleep onset would give you way more signal than subjective energy ratings",
      "createdUtc": 1771287928,
      "linkTitle": "I've been doing the 90-minute caffeine delay for 27 days now. Here's what actually happened",
      "permalink": "/r/HubermanLab/comments/1r3s4gi/ive_been_doing_the_90minute_caffeine_delay_for_27/o5s4uhu/",
      "mentionsSoma": true
    },
    {
      "id": "o5s4gyz",
      "subreddit": "BrainFog",
      "score": 1,
      "body": "biggest one was time-of-day patterns I'd completely missed. my fog was consistently worse between 2-4pm but I never connected it to meal timing until I started logging. turned out high glycemic lunches were tanking my clarity about 90 mins post-meal. switched to protein+fat heavy lunches and that afternoon window basically disappeared\n\nalso caught that my \"random bad days\" almost always followed nights where I fell asleep w/ screens on, even if total sleep hours looked fine",
      "createdUtc": 1771287799,
      "linkTitle": "your brain fog has a pattern you probably haven't caught yet",
      "permalink": "/r/BrainFog/comments/1r48ef1/your_brain_fog_has_a_pattern_you_probably_havent/o5s4gyz/",
      "mentionsSoma": false
    },
    {
      "id": "o5s4f6h",
      "subreddit": "BrainFog",
      "score": 1,
      "body": "fragmented sleep wrecking you more than short sleep makes total sense - sleep continuity is when your brain does most of its glymphatic clearance (basically flushing metabolic waste). you can get 5 hrs of solid sleep and function better than 8 hrs of broken sleep bc the cleanup cycles keep getting interrupted. that's a really useful pattern to have caught",
      "createdUtc": 1771287781,
      "linkTitle": "your brain fog has a pattern you probably haven't caught yet",
      "permalink": "/r/BrainFog/comments/1r48ef1/your_brain_fog_has_a_pattern_you_probably_havent/o5s4f6h/",
      "mentionsSoma": false
    },
    {
      "id": "o5s4d81",
      "subreddit": "HubermanLab",
      "score": 1,
      "body": "lmao the schumann resonance crowd and I are not the same",
      "createdUtc": 1771287762,
      "linkTitle": "your \"energy levels\" aren't a real metric",
      "permalink": "/r/HubermanLab/comments/1r3yefd/your_energy_levels_arent_a_real_metric/o5s4d81/",
      "mentionsSoma": false
    },
    {
      "id": "o5s4b76",
      "subreddit": "HubermanLab",
      "score": 1,
      "body": "grip strength is actually a surprisingly solid proxy for general CNS readiness - there's decent literature linking it to overall neural drive and autonomic state. some strength coaches use it as a daily readiness check before training\n\nit won't tell you much about cognitive specifics tho (working memory, processing speed, attentional control are all seperate systems). I use a mix of things - reaction time tests, some working memory stuff, a cognitive tracking tool I'm building on the side (soma-health.co if you're curious). grip + cognitive metrics together would honestly be a pretty solid daily systems check",
      "createdUtc": 1771287743,
      "linkTitle": "your \"energy levels\" aren't a real metric",
      "permalink": "/r/HubermanLab/comments/1r3yefd/your_energy_levels_arent_a_real_metric/o5s4b76/",
      "mentionsSoma": true
    },
    {
      "id": "o5s44rb",
      "subreddit": "HubermanLab",
      "score": 1,
      "body": "that's a totally fair pushback and honestly I should've been clearer - the post was aimed more at people who say \"I feel energized\" after some supplement and assume it worked. for someone managing chronic illness where energy is the difference between functional and bedridden, that subjective tracking IS the data\n\nglad the new protocol is shifting things for you btw, that morning alertness change sounds legit",
      "createdUtc": 1771287682,
      "linkTitle": "your \"energy levels\" aren't a real metric",
      "permalink": "/r/HubermanLab/comments/1r3yefd/your_energy_levels_arent_a_real_metric/o5s44rb/",
      "mentionsSoma": false
    },
    {
      "id": "o5s3xj2",
      "subreddit": "HubermanLab",
      "score": 1,
      "body": "yeah the drift-count thing is actually legit - that's basically a crude measure of sustained attention and attentional switching. the prefrontal cortex has to actively maintain task focus against default mode network activity, and when that maintenance fails you get the drift\n\nmy issue w/ purely subjective counts tho is you habituate to noticing. week 1 you catch 12 drifts, week 3 you catch 6, bc you got worse at noticing. that's where even a simple reaction time test before/after gives you something your self awareness can't game",
      "createdUtc": 1771287614,
      "linkTitle": "your \"energy levels\" aren't a real metric",
      "permalink": "/r/HubermanLab/comments/1r3yefd/your_energy_levels_arent_a_real_metric/o5s3xj2/",
      "mentionsSoma": false
    },
    {
      "id": "o5rxdaj",
      "subreddit": "ouraring",
      "score": 1,
      "body": "fwiw the HRV and resting heart rate tracking is genuinely useful for stimulant monitoring, you'll see your resting HR creep up on days you take it and that's worth having data on. the part oura can't help w/ is whether the stimulant is actually improving your executive function or just making you feel more alert - those are seperate things neurologically. for the ADHD novelty thing, I've kept mine bc I stopped caring about daily scores and just look at weekly trends. way less dopamine-hitty, way more useful",
      "createdUtc": 1771285359,
      "linkTitle": "Looking for advice: Should I invest in the ring? (ADHD)",
      "permalink": "/r/ouraring/comments/1r665kv/looking_for_advice_should_i_invest_in_the_ring/o5rxdaj/",
      "mentionsSoma": false
    },
    {
      "id": "o5rxa8l",
      "subreddit": "ouraring",
      "score": 1,
      "body": "one thing nobody's mentioning - deep sleep duration on oura is measured via movement and heart rate patterns, not actual EEG. so you could \"increase\" your deep sleep number w/ room temp tricks and still have shitty slow wave quality underneath. the glymphatic system does most of its waste clearance during deep sleep but the eficiency of that process depends on more than just how many minutes oura labels as deep. if you're an athlete worried about recovery I'd honestly care less about hitting some arbitrary minute target and more about whether your cognitive function is actually sharper the next day. that's the output that matters, sleep stages are just the input",
      "createdUtc": 1771285329,
      "linkTitle": "What tricks have you all used to increase deep sleep??",
      "permalink": "/r/ouraring/comments/1r6hy8o/what_tricks_have_you_all_used_to_increase_deep/o5rxa8l/",
      "mentionsSoma": false
    },
    {
      "id": "o59uzuq",
      "subreddit": "BrainFog",
      "score": 1,
      "body": "reading is one of the most metabolically expensive things your brain does - visual processing, language comprehension, working memory all firing simultaneously. if there's any mitochondrial or metabolic issue reading is where it shows up first bc the energy demand is highest. convergance insufficiency is also worth ruling out, gets missed all the time",
      "createdUtc": 1771035193,
      "linkTitle": "Fog kicks in when reading?",
      "permalink": "/r/BrainFog/comments/1r30mwm/fog_kicks_in_when_reading/o59uzuq/",
      "mentionsSoma": false
    },
    {
      "id": "o59uy7p",
      "subreddit": "BrainFog",
      "score": 2,
      "body": "the speed of return is the biggest clue here. next-morning onset rules out most psychological explanations bc those shift gradually. that timeline screams enviromental trigger - mold, VOCs from building materials, even water quality differences can drive low grade neuroinflammation that clears within days of leaving. I'd get an air quality monitor before anything else",
      "createdUtc": 1771035175,
      "linkTitle": "Went on a trip, brainfog went away",
      "permalink": "/r/BrainFog/comments/1r3p42z/went_on_a_trip_brainfog_went_away/o59uy7p/",
      "mentionsSoma": false
    },
    {
      "id": "o57lfqv",
      "subreddit": "HubermanLab",
      "score": 1,
      "body": "I actually love this post. one thing worth noting tho, self-ratings tend to drift as you adapt, like what you call a \"6\" in week 3 might not be the same as week 1 bc your baseline expectation shifted. the sleep onset number is probably your most solid data point since it's harder to unconsciously fudge",
      "createdUtc": 1771008563,
      "linkTitle": "I've been doing the 90-minute caffeine delay for 27 days now. Here's what actually happened",
      "permalink": "/r/HubermanLab/comments/1r3s4gi/ive_been_doing_the_90minute_caffeine_delay_for_27/o57lfqv/",
      "mentionsSoma": false
    },
    {
      "id": "o4xb7h0",
      "subreddit": "coldplunge",
      "score": 1,
      "body": "real",
      "createdUtc": 1770868819,
      "linkTitle": "Cold Plunge Benefits Vary Wildly Between People and Nobody Talks About Why",
      "permalink": "/r/coldplunge/comments/1r25c88/cold_plunge_benefits_vary_wildly_between_people/o4xb7h0/",
      "mentionsSoma": false
    },
    {
      "id": "o4x5jaa",
      "subreddit": "coldplunge",
      "score": 1,
      "body": "ocean cold exposure is a whole different animal too bc you've got wave impact, salt water mineral absorption through skin, and the unpredictability forcing way more active engagement than sitting in a tub. wouldn't surprise me if half the benefit people get from ocean plunging is from stuff that has nothing to do w temperature",
      "createdUtc": 1770866569,
      "linkTitle": "Cold Plunge Benefits Vary Wildly Between People and Nobody Talks About Why",
      "permalink": "/r/coldplunge/comments/1r25c88/cold_plunge_benefits_vary_wildly_between_people/o4x5jaa/",
      "mentionsSoma": false
    },
    {
      "id": "o4x5cwb",
      "subreddit": "Biohackers",
      "score": 1,
      "body": "yeah the fasted to spike to crash combo is tough.. the speed of the drop matters way more than where you land. have you tried eating protein/fat before carbs? blunts that initial spike a lot which usually flattens the whole curv",
      "createdUtc": 1770866500,
      "linkTitle": "You're Probably Misdiagnosing Your Post-Lunch Crash",
      "permalink": "/r/Biohackers/comments/1r1gk7d/youre_probably_misdiagnosing_your_postlunch_crash/o4x5cwb/",
      "mentionsSoma": false
    },
    {
      "id": "o4x3w9k",
      "subreddit": "Biohackers",
      "score": 2,
      "body": "makes sense, smaller meal = smaller insulin response = less parasympathetic shift. also dinner timing matters bc your circadian clock downregulates insulin sensitivity later in the day so the same meal at noon vs 8pm can hit you completely differently..",
      "createdUtc": 1770865948,
      "linkTitle": "You're Probably Misdiagnosing Your Post-Lunch Crash",
      "permalink": "/r/Biohackers/comments/1r1gk7d/youre_probably_misdiagnosing_your_postlunch_crash/o4x3w9k/",
      "mentionsSoma": false
    },
    {
      "id": "o4x3udb",
      "subreddit": "coldplunge",
      "score": 1,
      "body": "the adaptation part is real but it also muddies the picture bc adapting to cold and getting cognitive/mood benefits from cold are different mechanisms. you can fully habituate to where it barely bothers you and still get the norepinephrine spike, or you can habituate and lose most of the neurochemical response too. depends on the person and the protocol. which is kinda the whole problem w this stuff loll",
      "createdUtc": 1770865928,
      "linkTitle": "Cold Plunge Benefits Vary Wildly Between People and Nobody Talks About Why",
      "permalink": "/r/coldplunge/comments/1r25c88/cold_plunge_benefits_vary_wildly_between_people/o4x3udb/",
      "mentionsSoma": false
    },
    {
      "id": "o4x3s7c",
      "subreddit": "Biohackers",
      "score": 1,
      "body": "yeah this is the one people miss. it's not about going hypoglycemic in absolute terms, it's the rate of change that triggers symptoms. you can go from 140 to 90 in 45 min and feel like absolute shit even tho 90 is technically normal. the delta matters more than the number. CGMs made this way more visible but most people still just check fasting glucose and call it a day",
      "createdUtc": 1770865905,
      "linkTitle": "You're Probably Misdiagnosing Your Post-Lunch Crash",
      "permalink": "/r/Biohackers/comments/1r1gk7d/youre_probably_misdiagnosing_your_postlunch_crash/o4x3s7c/",
      "mentionsSoma": false
    },
    {
      "id": "o4x3pv6",
      "subreddit": "coldplunge",
      "score": 1,
      "body": "honestly fair. if it feels good and makes you happy that's a perfectly valid reason to do it and I don't think everything needs a spreadsheet attached to it. my thing is more about the people who ARE trying to optimize specific outcomes like anxiety or inflammation and then guessing whether it's working based on vibes for months. if you're just doing it bc you enjoy it then yeah who cares about tracking",
      "createdUtc": 1770865880,
      "linkTitle": "Cold Plunge Benefits Vary Wildly Between People and Nobody Talks About Why",
      "permalink": "/r/coldplunge/comments/1r25c88/cold_plunge_benefits_vary_wildly_between_people/o4x3pv6/",
      "mentionsSoma": false
    },
    {
      "id": "o4x3nxu",
      "subreddit": "coldplunge",
      "score": 2,
      "body": "67 days w no adaptation is actually unusual and worth paying attention to. a few things that might be going on: 46 degrees for 3-5 min is a solid protocol but if you're shivering before you finish you might be overshooting your current tolerance and triggering a sustained stress response instead of the acute hormetic one you want. the whole point is brief intense cold -> recovery, not prolonged cold -> your body stays in fight or flight for hours after\n\nalso the anxiety thing is worth flagging bc cold exposure raises norepinephrine pretty dramatically and if your baseline sympathetic tone is already high (which living in AZ heat can actually do weirdly enough) you might just be stacking stress on stress. have you tried shorter duration at the same temp? like 90 seconds and actually getting out before the shiver starts?",
      "createdUtc": 1770865860,
      "linkTitle": "Cold Plunge Benefits Vary Wildly Between People and Nobody Talks About Why",
      "permalink": "/r/coldplunge/comments/1r25c88/cold_plunge_benefits_vary_wildly_between_people/o4x3nxu/",
      "mentionsSoma": false
    },
    {
      "id": "o4x3eak",
      "subreddit": "getdisciplined",
      "score": 2,
      "body": "yeah exactly this. the planning itself feels productive so your brain checks the \"I did something\" box before you've actually done anything. I started just writing down 1-3 things max for the day and it forced me to actually prioritize instead of making a list that looked impressive but was never gonna happen",
      "createdUtc": 1770865759,
      "linkTitle": "the gap between feeling productive and being productive is way bigger than you think",
      "permalink": "/r/getdisciplined/comments/1r28jda/the_gap_between_feeling_productive_and_being/o4x3eak/",
      "mentionsSoma": false
    },
    {
      "id": "o4x3c2z",
      "subreddit": "Biohackers",
      "score": 2,
      "body": "the anxiety piece is interesting bc that's usually vagal signaling not just blood sugar. when your gut starts working on a meal it pulls parasympathetic resources and your autonomic nervous system can misread that shift as a threat, especially if you're already running a high baseline sympathetic tone from stress\n\nthings that actually helped me w this: smaller meals obviously, but also paying attention to meal composition. high glycemic carbs alone are the worst offender but protein + fat w carbs blunts the insulin spike that triggers the reactive crash. also walking for even 10 min after eating does more than any supplement I've tried\n\nfor the executive function part specifically I'd track it objectively bc \"I feel foggy after lunch\" and actually having impaired working memory are sometimes two different things. I use reaction time tests and some cognitive tracking stuff I'm working on (soma-health.co) and was surprised how often my subjective foggy feeling didn't match actual performance drops. sometimes the fatigue is real, sometimes it's just your body redirecting blood flow and you feel off but your cognition is fine",
      "createdUtc": 1770865735,
      "linkTitle": "You're Probably Misdiagnosing Your Post-Lunch Crash",
      "permalink": "/r/Biohackers/comments/1r1gk7d/youre_probably_misdiagnosing_your_postlunch_crash/o4x3c2z/",
      "mentionsSoma": true
    },
    {
      "id": "o4x39jk",
      "subreddit": "coldplunge",
      "score": 2,
      "body": "honestly there's no perfect answer yet which is part of the problem. for neurochemical stuff you can't really track norepinephrine or dopamine directly without blood draws and even those are indirect markers at best\n\nfor cognitive benefits tho you actually can measure pretty well. reaction time tests (humanbenchmark.com is free), working memory tasks like dual n-back, cambridge brain sciences has some decent assessments. I've been building something that tracks cognitive function through voice biomarkers which is way less effort than sitting down for tests every day (waitlist at soma-health.co if you're curious) but even just doing a 2 min reaction time test before and after plunging for a few weeks will tell you way more than vibes\n\nthe key is testing consistently at the same time of day bc your baseline shifts a lot w circadian rhythm. most people test once, feel sharp after a plunge, and call it proof. you need like 2-3 weeks of data minimum to see if there's an actual pattern",
      "createdUtc": 1770865708,
      "linkTitle": "Cold Plunge Benefits Vary Wildly Between People and Nobody Talks About Why",
      "permalink": "/r/coldplunge/comments/1r25c88/cold_plunge_benefits_vary_wildly_between_people/o4x39jk/",
      "mentionsSoma": true
    },
    {
      "id": "o4vix66",
      "subreddit": "coldplunge",
      "score": 3,
      "body": "Ok this is definitely NOT what I was referring to",
      "createdUtc": 1770846578,
      "linkTitle": "Cold Plunge Benefits Vary Wildly Between People and Nobody Talks About Why",
      "permalink": "/r/coldplunge/comments/1r25c88/cold_plunge_benefits_vary_wildly_between_people/o4vix66/",
      "mentionsSoma": false
    },
    {
      "id": "o4uhph7",
      "subreddit": "getdisciplined",
      "score": 1,
      "body": "this sounds way more like an executive function thing than laziness tbh. your raw cognitive horsepower is clearly there - it's the initiation/scheduling system that's misfiring, and those are completely different circuits in your prefrontal cortex\n\nI know it feels like a character flaw but it's a wiring issue that's super common in high-scoring people. have you ever had executive function tested separately from general cognition? most standard psych evals don't break those apart and it changes everything about what actually helps",
      "createdUtc": 1770835890,
      "linkTitle": "i’m ACTUALLY lazy. i’m a failure due to complete negligence.",
      "permalink": "/r/getdisciplined/comments/1r0jh1g/im_actually_lazy_im_a_failure_due_to_complete/o4uhph7/",
      "mentionsSoma": false
    },
    {
      "id": "o4ufflz",
      "subreddit": "getdisciplined",
      "score": 1,
      "body": "the 2am sleep thing is doing way more damage than you probably realize. at that age your prefrontal cortex is still developing and chronic sleep deprivation literally impairs the same executive function circuits that depression hits. so the \"depressed or lazy\" question is almost imposible to answer when you're running on 5 hours bc sleep debt mimics both\n\nfwiw methylphenidate making you sadder tracks - stimulants on an already depleted dopaminergic system can flatten affect pretty fast. I'd honestly fix the sleep before trying to diagnose anything else, your brain can't give you accurate signal about its own state when it's that impared",
      "createdUtc": 1770835262,
      "linkTitle": "Am I depressed or just lazy",
      "permalink": "/r/getdisciplined/comments/1r0knji/am_i_depressed_or_just_lazy/o4ufflz/",
      "mentionsSoma": false
    },
    {
      "id": "o4pf3qj",
      "subreddit": "coldplunge",
      "score": 1,
      "body": "1c is pretty fcking cold - at that temp you're getting pretty agressive peripheral vasoconstriction and the rewarming process after can cause vasospasm in the small vessels in your fingers. 24hrs of pins and needles is longer than typical though, especially if it's still happening. might be worth checking if you have any raynaud's tendencies bc that temp range can unmask it. neoprene gloves like the other commenter said are smart, but I'd also just give your hands a longer gradual rewarm after instead of letting them air dry in the cold",
      "createdUtc": 1770765617,
      "linkTitle": "anyone had these symptoms *after* a plunge?",
      "permalink": "/r/coldplunge/comments/1r0ex1s/anyone_had_these_symptoms_after_a_plunge/o4pf3qj/",
      "mentionsSoma": false
    },
    {
      "id": "o4pev4j",
      "subreddit": "coldplunge",
      "score": 1,
      "body": "the elvanse is probably a big factor here tbh. lisdexamfetamine already pushes sympathetic tone pretty hard - then you're stacking massive vasodilation from sauna w/ sudden vasoconstriction from the plunge on top of that. your autonomic system is basically getting whiplash from three directions at once. the dizziness is likely a blood pressure crash during the transition, stimulants can make that rebound way less predictable. I'd talk to whoever prescribes your elvanse before mixing these again, and definately don't skip time between sauna and plunge - that transition period matters more than most people realize",
      "createdUtc": 1770765539,
      "linkTitle": "Post-sauna & plunge disorientation/exhaustion.",
      "permalink": "/r/coldplunge/comments/1r074x1/postsauna_plunge_disorientationexhaustion/o4pev4j/",
      "mentionsSoma": false
    },
    {
      "id": "o4o69lv",
      "subreddit": "Biohackers",
      "score": 2,
      "body": "incredible breakdown but kinda wild that we have 17 sources comparing wearables on sleep staging, HRV, SpO2, step counts... and literally ZERO validated consumer metrics for whether your brain is actually performing well. we measure everything about the body except cognitive output",
      "createdUtc": 1770752602,
      "linkTitle": "Research findings on the \"most accurate\" health wearable by metric. Oura Ring, Apple Watch, Fitbit, Garmin, Samsung Galaxy Watch, etc.",
      "permalink": "/r/Biohackers/comments/1r0kyf8/research_findings_on_the_most_accurate_health/o4o69lv/",
      "mentionsSoma": false
    },
    {
      "id": "o4o625n",
      "subreddit": "Biohackers",
      "score": 2,
      "body": "vyvanse working but not adderall is actually super telling - they hit dopamine/norepinephrine ratios differently so your issue is probably more specific than \"low dopamine\"   \n  \nproblem is without actually measuring which cognitive domains are impaired, you're just throwing shit at the wall and seeing what sticks",
      "createdUtc": 1770752545,
      "linkTitle": "Missing Brain Nutrient/ Low Brain Energy",
      "permalink": "/r/Biohackers/comments/1r0pbqy/missing_brain_nutrient_low_brain_energy/o4o625n/",
      "mentionsSoma": false
    },
    {
      "id": "o3yt6b8",
      "subreddit": "whoop",
      "score": 1,
      "body": "worth considering that hrv and resting heart rate are downstream of a lot of things including nervous system strain - not just physical training load\n\nif you're pushing hard mentally (work stress, decision fatigue, sleep quality issues beyond just duration) that'll tank hrv too. whoop can't tell the diference between physical overtraining and cognitive overload, they both look like \"low recovery\" in the data\n\nmight be worth tracking cognitive stuff seperately to see what's actually going on",
      "createdUtc": 1770410628,
      "linkTitle": "I have a hard time understanding Whoop.",
      "permalink": "/r/whoop/comments/1qwjc74/i_have_a_hard_time_understanding_whoop/o3yt6b8/",
      "mentionsSoma": false
    },
    {
      "id": "o3yt3fi",
      "subreddit": "whoop",
      "score": 1,
      "body": "had this recently but it made me realize whoop tracks everything except the thing that actually matters for my daily performance - whether my brain is working well\n\nlike my hrv is green, sleep is solid, recovery is 75%... but I'm still foggy and cant concentrate for shit. whoop tells me my body recovered but has no idea if my brain did",
      "createdUtc": 1770410603,
      "linkTitle": "[DISCUSSION] That “damn… WHOOP was right” moment",
      "permalink": "/r/whoop/comments/1qwyri4/discussion_that_damn_whoop_was_right_moment/o3yt3fi/",
      "mentionsSoma": false
    },
    {
      "id": "o3tfh4l",
      "subreddit": "coldplunge",
      "score": 1,
      "body": "depends what you're optimizing for tbh. rewarming too fast after cold blunts the norepinephrine response - that's where most of the mood/alertness stuff comes from. for pure muscle recovrey the order matters less, contrast cycling works either way. I'd end on cold if you care about the brain effects",
      "createdUtc": 1770338059,
      "linkTitle": "Far IR sauna after plunge?",
      "permalink": "/r/coldplunge/comments/1qw85mw/far_ir_sauna_after_plunge/o3tfh4l/",
      "mentionsSoma": false
    },
    {
      "id": "o39883v",
      "subreddit": "BrainFog",
      "score": 1,
      "body": "totally, feel free to DM! and waitlist is soma-health.co",
      "createdUtc": 1770078541,
      "linkTitle": "Brain Fog Compounds Like Hell",
      "permalink": "/r/BrainFog/comments/1qo9cdx/brain_fog_compounds_like_hell/o39883v/",
      "mentionsSoma": true
    },
    {
      "id": "o397zyp",
      "subreddit": "ouraring",
      "score": 1,
      "body": "the uncomfortable truth is humans are actually shit at perceiving our own physiological states - there's a ton of research on interoceptive accuracy and most people wildly misestimate things like their own heart rate, stress levels, even sleep quality. you \"know\" when you slept badly but do you actually know which nights your HRV tanked vs which nights you just woke up groggy bc of sleep timing? diferent things, different interventions",
      "createdUtc": 1770078468,
      "linkTitle": "Long time listener, first time caller",
      "permalink": "/r/ouraring/comments/1qtadk3/long_time_listener_first_time_caller/o397zyp/",
      "mentionsSoma": false
    },
    {
      "id": "o397e1c",
      "subreddit": "ouraring",
      "score": 2,
      "body": "honestly a month isn't that long for your autonomic nervous system to recalibrate after regular cannabis use. your endocannabinoid system was basically outsourcing a ton of regulation to external THC - CB1 receptors in the brainstem and vagal circuits get downregulated hard w/ chronic use\n\nHRV in the teens sucks but it's your body relearning how to modulate parasympathetic tone without the assist. most literature I've seen suggests 4-8 weeks for receptor density to normalize, sometimes longer depending on how heavy use was. the fact that your other withdrawl symptoms passed doesn't mean the deeper autonomic stuff is done - that's slower\n\nwould actually keep tracking it closely bc HRV recovery trajectory tells you more than any single number",
      "createdUtc": 1770078268,
      "linkTitle": "Ok I’m like *concerned* now",
      "permalink": "/r/ouraring/comments/1qt0db7/ok_im_like_concerned_now/o397e1c/",
      "mentionsSoma": false
    },
    {
      "id": "o2k3mlf",
      "subreddit": "getdisciplined",
      "score": 3,
      "body": "Protein timing was huge - eating protein within 30min of waking up vs later in morning made a measurable diference in working memory tests. I almost dropped it bc it felt annoying to prioritize breakfast\n\nbreaks during deep work - taking actual breaks (walking, not scrolling) every 90min helped way more than pushing through. I thought pushing through showed more discipline but cognitively it tanked me\n\ncutting caffeine after 2pm did more for sleep quality than my entire evening routine combined\n\nthe things that didn't work when I tested them: elaborate morning routines (felt productive, did nothing), most nootropics (placebo city), working out fasted (made me feel like shit and data confirmed it)\n\nhonestly measurement was what mattered most. I'm building something for this now (waitlist at soma-health.co if you want to try) but even basic reaction time tests showed patterns I never would've caught\n\nThe key is testing one variable at a time. Eg if you want to change your sleep schedule, measure for a week before changing anything else. otherwise you have no idea what's actually moving the needle vs what just coincided with a good week\n\nAnd take everything with a grain of salt, what works for me may not work for you, and vice versa",
      "createdUtc": 1769754146,
      "linkTitle": "Measure. Your. Discipline.",
      "permalink": "/r/getdisciplined/comments/1qqx888/measure_your_discipline/o2k3mlf/",
      "mentionsSoma": true
    },
    {
      "id": "o2k2kap",
      "subreddit": "BrainFog",
      "score": 8,
      "body": "cortisol tests for stress hormones, hrv for autonomic tone, cognitive tests like cambridge brain sciences or quantified mind for working memory and reaction time baselines\n\nI actually quit my vc job to build something for the cognitive stuff bc I kept seeing people (including myself) try to optimize brain health without measuring anything, did my phd in comp neuro so this drove me especially insane. in beta rn but waitlist is soma-health.co\n\nhappy to answer questions about measurement approaches if useful",
      "createdUtc": 1769753639,
      "linkTitle": "Severe brain fog – alcohol is the only thing that clears it a bit and I don’t understand why",
      "permalink": "/r/BrainFog/comments/1qqbrpo/severe_brain_fog_alcohol_is_the_only_thing_that/o2k2kap/",
      "mentionsSoma": true
    },
    {
      "id": "o2jtlx9",
      "subreddit": "BrainFog",
      "score": 10,
      "body": "alcohol hits gaba receptors hard which temporarily reduces excitatory activity in your prefrontal cortex. if your baseline state is chronic hyperarousal (which the 'trapped behind a wall' thing suggests), alcohol basically forces your nervous system to stop firing so intensely\n\nthe issue is its a really crude tool that affects every gaba receptor in your brain, not just the overactive circuits causing the fog. so you get temporary relief but you're not actually fixing the underlying excitatory/inhibitory imbalance\n\nhonestly without measuring whats actually happening in your system (stress markers, cognitive baselines, etc) you're just shooting in the dark trying to figure out if its anxiety vs dissociation vs something else",
      "createdUtc": 1769749673,
      "linkTitle": "Severe brain fog – alcohol is the only thing that clears it a bit and I don’t understand why",
      "permalink": "/r/BrainFog/comments/1qqbrpo/severe_brain_fog_alcohol_is_the_only_thing_that/o2jtlx9/",
      "mentionsSoma": false
    },
    {
      "id": "o2jt2lg",
      "subreddit": "productivity",
      "score": 1,
      "body": "the problem is encoding not memory. passive watching barely activates the hippocampus enough to bother storing anything long term\n\nmemory consolidation happens during actual retrieval. if you never test yourself theres literally no signal to your brain that this info matters enough to keep\n\nthere're old roediger studies showing people who tested themselves retained like 50% more after a week compared to people who just reviewed. you never actually learned it, just felt like you did bc watching gave you that illusion of competence",
      "createdUtc": 1769749450,
      "linkTitle": "Do you watch educational videos but forget everything a week later?",
      "permalink": "/r/productivity/comments/1qp3lbg/do_you_watch_educational_videos_but_forget/o2jt2lg/",
      "mentionsSoma": false
    },
    {
      "id": "o2jrpau",
      "subreddit": "productivity",
      "score": 1,
      "body": "if you keep outsourcing working memory consistently, those pathways literally weaken. its the same mechanism as muscle atrophy but for neural circuits in your prefrontal cortex\n\nThe real issue is you probably cant tell how much actually degraded bc cognitive decline is gradual. most people's subjective sense of 'im dumber' is either way overblown or way underestimating the damage depending on which systems got hit\n\nreaction time tests and working memory benchmarks would tell you what actually changed but unfortunately nobody measures this stuff",
      "createdUtc": 1769748892,
      "linkTitle": "How To Quit ChatGPT Addiction?",
      "permalink": "/r/productivity/comments/1qqpzec/how_to_quit_chatgpt_addiction/o2jrpau/",
      "mentionsSoma": false
    },
    {
      "id": "o2jhbb7",
      "subreddit": "HubermanLab",
      "score": 2,
      "body": "breaking things into smaller chunks definitley helps but how do you know your retention actually improved vs just feels better? \n\nthe brain is really good at making you think you're improving when you're plateauing. I started tracking reaction time seperately from skill practice and realized the days I felt like I was crushing it, my actual metrics were often pretty flat\n\nif you're not measuring something objective you're just guessing",
      "createdUtc": 1769744968,
      "linkTitle": "How has embracing Huberman's insights on neuroplasticity transformed your approach to learning new skills?",
      "permalink": "/r/HubermanLab/comments/1qqeueu/how_has_embracing_hubermans_insights_on/o2jhbb7/",
      "mentionsSoma": false
    },
    {
      "id": "o242ihm",
      "subreddit": "Biohackers",
      "score": 1,
      "body": "hey - I get the panic w/ 5 days left but please don't start stacking random peptides when you don't know what your baseline cognitive state even is right now. bromantane affecting dopamine/norepinephrine systems, oxytocin hitting social/emotional circuits - these aren't interchangeable and you have zero data on what's actually impaired\n\nthe post-flu cognitive crash you're describing sounds more like neuroinflammation than a peptide deficiency. your microglia are probably still activated from the immune response which impairs synaptic function and slows processing speed. throwing more neurochemical modulation at inflamed circuits rarely helps\n\nnot trying to be harsh but: if you can't mesure what's broken you can't fix it systematically. taking 6 hours to read a line isn't a \"low dopamine\" problem or an \"oxytocin\" problem - that's a sign your neural signaling is fundamentaly disrupted and needs time not more compounds\n\nthe boring answer for 5 days: sleep, anti-inflammatory diet, maybe NAC for oxidative stress. I know thats not what you want to hear",
      "createdUtc": 1769556152,
      "linkTitle": "Desperate for help — brain fog, exams, and considering oxytocin (not sure what to do)",
      "permalink": "/r/Biohackers/comments/1qnllxp/desperate_for_help_brain_fog_exams_and/o242ihm/",
      "mentionsSoma": false
    },
    {
      "id": "o242dyw",
      "subreddit": "Biohackers",
      "score": 2,
      "body": "dealt w something similar on ashwagandha, that \"dead inside\" feeling is real lol. what you're describing sounds like overactive GABAergic tone suppressing your dopamine/norepinephrine systems. ashwagandha works throguh the HPA axis which is great for acute anxiety but when you take it chronically it can completley flatten your reward circuitry\n\nthe scary part is you have no idea when this shift happened bc youre not measuring anything. you just wake up one day and realize you've been a zombie for months. I saw this pattern a lot in research, people would take adaptogens \"for stress\" but never track whether their actual stress markers (cortisol rhythm, HRV variability) were even out of range to begin with\n\ngood news is dopamine systems bounce back pretty fast once you stop. bad news is you lost months flying blind. if you were tracking cognitive load or mental clarity daily you wouldve caught this way earlier when the cost-benefit flipped\n\ncurious if you felt the flatness set in gradually or if it was sudden",
      "createdUtc": 1769556114,
      "linkTitle": "So after years of trying to figure out what's wrong....",
      "permalink": "/r/Biohackers/comments/1qo82w6/so_after_years_of_trying_to_figure_out_whats_wrong/o242dyw/",
      "mentionsSoma": false
    },
    {
      "id": "o23zc6v",
      "subreddit": "coldplunge",
      "score": 1,
      "body": "sources:  \nsramek study: [https://pubmed.ncbi.nlm.nih.gov/10751106/](https://pubmed.ncbi.nlm.nih.gov/10751106/)  \nhuberman: [https://www.hubermanlab.com/episode/using-deliberate-cold-exposure-for-health-and-performance](https://www.hubermanlab.com/episode/using-deliberate-cold-exposure-for-health-and-performance)",
      "createdUtc": 1769555192,
      "linkTitle": "Cold Plunging Probably Works But Not for the Reasons Everyone Thinks",
      "permalink": "/r/coldplunge/comments/1qottmu/cold_plunging_probably_works_but_not_for_the/o23zc6v/",
      "mentionsSoma": false
    },
    {
      "id": "o23yacu",
      "subreddit": "coldplunge",
      "score": 2,
      "body": "you're basically training your prefrontal cortex to override panic signals and that circuit doesnt really distinguish between \"cold water threat\" and \"difficult email threat\" so the pattern transfers   \n  \npretty well documented effect tbh, the fact that it works outside the tub is the whole point",
      "createdUtc": 1769554876,
      "linkTitle": "Cold plunging kinda changed how I handle stress",
      "permalink": "/r/coldplunge/comments/1qn0xup/cold_plunging_kinda_changed_how_i_handle_stress/o23yacu/",
      "mentionsSoma": false
    },
    {
      "id": "o1zkd5t",
      "subreddit": "BrainFog",
      "score": 1,
      "body": "tried a bunch of these during my phd, the problem is most track inputs (sleep, HRV, bloodwork) but don't actually measure cognitive function directly\n\nyou can have perfect biomarkers and still have your working memory completely shot. or perform worse on attention tasks but feel \"fine\" bc you adapted to a lower baseline\n\nfound it more helpful to track objective shit like how long routine tasks take or how many times I reread things. told me more about actual state than any dashboard\n\ncurious if you found any that measure cognition vs just inputs? most just give you more data to analyze when your brain already can't handle analyzing fucking data",
      "createdUtc": 1769506104,
      "linkTitle": "Has anyone here tried functional health apps or platforms to understand brain fog / fatigue?",
      "permalink": "/r/BrainFog/comments/1qo0rjp/has_anyone_here_tried_functional_health_apps_or/o1zkd5t/",
      "mentionsSoma": false
    },
    {
      "id": "o1zigmg",
      "subreddit": "productivity",
      "score": 2,
      "body": "your brain literally learned to associate that environment w/ a stress response. when you go back, you're reactivating the same overloaded pathways\n\nvacation works temporarily but crashes within days bc nothing actually changed, same cognitive load hitting your PFC, same cues triggering stress responses. it's a learned circuit your brain falls back into\n\nsaw this constantly in research settings. people who actually recovered either structurally changed the work itself (not boundries, actual cognitive demands) or left entirely. if the setup stays identical your brain just re-learns the pattern faster each time\n\nthe annoying part is most people never measure if they actually recovered. they feel less tired for a bit but working memory is still impaired, decisions still feel p hard",
      "createdUtc": 1769505035,
      "linkTitle": "Why does burn out come back so quickly after time off?",
      "permalink": "/r/productivity/comments/1qlmr3d/why_does_burn_out_come_back_so_quickly_after_time/o1zigmg/",
      "mentionsSoma": false
    },
    {
      "id": "o17ad57",
      "subreddit": "Biohackers",
      "score": 1,
      "body": "vitamin d affects dopamine synthesis and can be pretty stimulating for some people even at low doses like 1k. its not just about when you take it, its affecting neurotransmitter production throughout the day\n\nif youre that sensitive to it you could try splitting the dose even smaller (500 iu) or switching to d2 instead of d3 which some people tolerate better. or just get more sun exposure if thats an option and skip supplementing entirely\n\nthe headache piece is interesting though, that could be magnesium depletion. vit d increases calcium absorption which can deplete mag, and low mag causes both headaches and sleep issues. might need to add mag glycinate at night if youre not already taking it\n\nnot saying stop the d completely but if 1k is causing this much trouble your system might just be really responsive to it... some people are",
      "createdUtc": 1769154772,
      "linkTitle": "Why’s vitamin D causing insomnia and headaches?",
      "permalink": "/r/Biohackers/comments/1qi1quz/whys_vitamin_d_causing_insomnia_and_headaches/o17ad57/",
      "mentionsSoma": false
    },
    {
      "id": "o179t16",
      "subreddit": "BrainFog",
      "score": 1,
      "body": "the dentist chair, breathing, exercise all helping is nervous system not mold. the dust in the car thing is the giveaway tbh. you literally went foggy bc you thought about dust for like 5 min. thats your brain not exposure lol\n\nsmth couldve initiated it but youre stuck in the pattern now. dealt with this myself before, the scanning makes it worse every time bc limbic system overprotection. not a doc but this is pretty textbook",
      "createdUtc": 1769154475,
      "linkTitle": "Functional brain fog, worse after eating & certain environments, better with exercise and deep breathing. Anyone else?",
      "permalink": "/r/BrainFog/comments/1pg246m/functional_brain_fog_worse_after_eating_certain/o179t16/",
      "mentionsSoma": false
    },
    {
      "id": "o175bwj",
      "subreddit": "productivity",
      "score": 2,
      "body": "ya this is def a co2 thing. closed rooms in general build up co2 and u dont notice it until your brain feels it. going by feel is kinda pointless bc ur brain is the thing that's impaired so it can't tell\n\ni just open a window every hour whether i feel like i need it or not",
      "createdUtc": 1769152118,
      "linkTitle": "Still struggling with afternoon brain fog when working in the same room - curious how others handle it",
      "permalink": "/r/productivity/comments/1qg25p5/still_struggling_with_afternoon_brain_fog_when/o175bwj/",
      "mentionsSoma": false
    },
    {
      "id": "o16v2ht",
      "subreddit": "NootropicsHelp",
      "score": 3,
      "body": "lion's mane - actual evidence for NGF and neurogenesis. most ppl underdose tho, need like 1-2g of quality extract",
      "createdUtc": 1769147182,
      "linkTitle": "Any nootropics for memory enhancement?",
      "permalink": "/r/NootropicsHelp/comments/1qi3z5t/any_nootropics_for_memory_enhancement/o16v2ht/",
      "mentionsSoma": false
    },
    {
      "id": "o16swdp",
      "subreddit": "HubermanLab",
      "score": 1,
      "body": "yep this tracks. cortisol naturally spikes when you wake up and caffeine basically does the same thing - so if you stack them you're just doubling up and then crashing harder later. waiting 90 mins lets your body do its thing first, then coffee actually adds something instead of just amplifying what's already happening\n\ni've noticed the same thing tbh. the afternoon slump used to hit me hard around 2-3pm and now it's way more manageable",
      "createdUtc": 1769146227,
      "linkTitle": "Drinking my morning coffee a little bit later helped me get rid of afternoon crashes",
      "permalink": "/r/HubermanLab/comments/1qjye2l/drinking_my_morning_coffee_a_little_bit_later/o16swdp/",
      "mentionsSoma": false
    },
    {
      "id": "o0rwvxb",
      "subreddit": "BrainFog",
      "score": 1,
      "body": "felt but the brain is wayy more plastic than you think. literally just sleep more (and on time) + take walks. does wonders for brain fog",
      "createdUtc": 1768958319,
      "linkTitle": "Wish I didn’t get damage",
      "permalink": "/r/BrainFog/comments/1qiaxrt/wish_i_didnt_get_damage/o0rwvxb/",
      "mentionsSoma": false
    },
    {
      "id": "nypn4gv",
      "subreddit": "HubermanLab",
      "score": 1,
      "body": "Is there any effective way to measure the increase/decrease in cognitive performance though? I could do XYZ but how do I know it's increasing/decreasing?",
      "createdUtc": 1768010140,
      "linkTitle": "What do you do to improve your cognitive performance? – Quick Survey",
      "permalink": "/r/HubermanLab/comments/1q4p3to/what_do_you_do_to_improve_your_cognitive/nypn4gv/",
      "mentionsSoma": false
    },
    {
      "id": "nyoffob",
      "subreddit": "ouraring",
      "score": 1,
      "body": "interesting. do you think they cap the lowest sleep score to be a certain range?",
      "createdUtc": 1767996324,
      "linkTitle": "Oura Ring Delivered",
      "permalink": "/r/ouraring/comments/1q7ugpr/oura_ring_delivered/nyoffob/",
      "mentionsSoma": false
    },
    {
      "id": "nyof9vi",
      "subreddit": "ouraring",
      "score": 1,
      "body": "that's smart",
      "createdUtc": 1767996279,
      "linkTitle": "Oura Ring Delivered",
      "permalink": "/r/ouraring/comments/1q7ugpr/oura_ring_delivered/nyof9vi/",
      "mentionsSoma": false
    },
    {
      "id": "nyiitdc",
      "subreddit": "ouraring",
      "score": 3,
      "body": "just wondering how has the ring proved that it's only mental stress? i just got my ring and as far as ive explored it doesn't capture mental stress per se and only physiological stress?",
      "createdUtc": 1767922281,
      "linkTitle": "Oura has completely changed my understanding of when my body is 'active'",
      "permalink": "/r/ouraring/comments/1q7k8wq/oura_has_completely_changed_my_understanding_of/nyiitdc/",
      "mentionsSoma": false
    },
    {
      "id": "n7i0rk7",
      "subreddit": "QuantifiedSelf",
      "score": 1,
      "body": "yeah but i want to see it against other things that Ill probably start tracking",
      "createdUtc": 1754605572,
      "linkTitle": "What do you guys look for in the data and how do you organize it?",
      "permalink": "/r/QuantifiedSelf/comments/1mjgt54/what_do_you_guys_look_for_in_the_data_and_how_do/n7i0rk7/",
      "mentionsSoma": false
    },
    {
      "id": "n7i0o7m",
      "subreddit": "QuantifiedSelf",
      "score": 2,
      "body": "sure! send me the link",
      "createdUtc": 1754605541,
      "linkTitle": "What do you guys look for in the data and how do you organize it?",
      "permalink": "/r/QuantifiedSelf/comments/1mjgt54/what_do_you_guys_look_for_in_the_data_and_how_do/n7i0o7m/",
      "mentionsSoma": false
    },
    {
      "id": "n7i0kjp",
      "subreddit": "QuantifiedSelf",
      "score": 1,
      "body": "do you feel like you have a consistent rating system for the subjective scale? some days i feel like my 5s might actually be lower than other says haha",
      "createdUtc": 1754605507,
      "linkTitle": "What do you guys look for in the data and how do you organize it?",
      "permalink": "/r/QuantifiedSelf/comments/1mjgt54/what_do_you_guys_look_for_in_the_data_and_how_do/n7i0kjp/",
      "mentionsSoma": false
    },
    {
      "id": "n73eus2",
      "subreddit": "QuantifiedSelf",
      "score": 1,
      "body": "ah gotcha - and it uses language patterns from your chats? or do you also input other language data?",
      "createdUtc": 1754417959,
      "linkTitle": "Do you guys measure brain fog or mental clarity?",
      "permalink": "/r/QuantifiedSelf/comments/1mddzpp/do_you_guys_measure_brain_fog_or_mental_clarity/n73eus2/",
      "mentionsSoma": false
    },
    {
      "id": "n6z3sg1",
      "subreddit": "QuantifiedSelf",
      "score": 1,
      "body": "woah how?",
      "createdUtc": 1754356241,
      "linkTitle": "Do you guys measure brain fog or mental clarity?",
      "permalink": "/r/QuantifiedSelf/comments/1mddzpp/do_you_guys_measure_brain_fog_or_mental_clarity/n6z3sg1/",
      "mentionsSoma": false
    },
    {
      "id": "n6yq4jf",
      "subreddit": "QuantifiedSelf",
      "score": 2,
      "body": "what is proddigy? is it a self-reporting app? would be interested in trying",
      "createdUtc": 1754351442,
      "linkTitle": "Do you guys measure brain fog or mental clarity?",
      "permalink": "/r/QuantifiedSelf/comments/1mddzpp/do_you_guys_measure_brain_fog_or_mental_clarity/n6yq4jf/",
      "mentionsSoma": false
    },
    {
      "id": "n698wok",
      "subreddit": "QuantifiedSelf",
      "score": 1,
      "body": "Dmed you! I'd be curious to hear what type of data you track...i.e. is it a mixture of physiological biometrics from health tracking devices or internal states that you rate yourself?",
      "createdUtc": 1754004107,
      "linkTitle": "Do you guys measure brain fog or mental clarity?",
      "permalink": "/r/QuantifiedSelf/comments/1mddzpp/do_you_guys_measure_brain_fog_or_mental_clarity/n698wok/",
      "mentionsSoma": false
    },
    {
      "id": "n698kqa",
      "subreddit": "coldplunge",
      "score": 2,
      "body": "Wow that's wild. Does it basically make you feel more awake? Have you found it affect your focus or memory?",
      "createdUtc": 1754003998,
      "linkTitle": "What are the most salient effects of cold plunge?",
      "permalink": "/r/coldplunge/comments/1mde1kv/what_are_the_most_salient_effects_of_cold_plunge/n698kqa/",
      "mentionsSoma": false
    },
    {
      "id": "n698ag6",
      "subreddit": "coldplunge",
      "score": 1,
      "body": "oh I would've thought it'd be the other way around",
      "createdUtc": 1754003902,
      "linkTitle": "What are the most salient effects of cold plunge?",
      "permalink": "/r/coldplunge/comments/1mde1kv/what_are_the_most_salient_effects_of_cold_plunge/n698ag6/",
      "mentionsSoma": false
    },
    {
      "id": "n674eyo",
      "subreddit": "QuantifiedSelf",
      "score": 1,
      "body": "Woah sounds like you have a whole system, would love to chat more about this. Will dm you!",
      "createdUtc": 1753981732,
      "linkTitle": "Do you guys measure brain fog or mental clarity?",
      "permalink": "/r/QuantifiedSelf/comments/1mddzpp/do_you_guys_measure_brain_fog_or_mental_clarity/n674eyo/",
      "mentionsSoma": false
    },
    {
      "id": "n673ydt",
      "subreddit": "QuantifiedSelf",
      "score": 2,
      "body": "oh that's a good idea! do you think you'll just do a 1-5 scale every 30 minutes? I'd be curious to follow your journey doing that and maybe try it myself",
      "createdUtc": 1753981607,
      "linkTitle": "Do you guys measure brain fog or mental clarity?",
      "permalink": "/r/QuantifiedSelf/comments/1mddzpp/do_you_guys_measure_brain_fog_or_mental_clarity/n673ydt/",
      "mentionsSoma": false
    },
    {
      "id": "n60urs4",
      "subreddit": "QuantifiedSelf",
      "score": 1,
      "body": "Interesting yeah, I've heard of people doing cognitive tests bot those seem to be more IQ related...",
      "createdUtc": 1753899749,
      "linkTitle": "Do you guys measure brain fog or mental clarity?",
      "permalink": "/r/QuantifiedSelf/comments/1mddzpp/do_you_guys_measure_brain_fog_or_mental_clarity/n60urs4/",
      "mentionsSoma": false
    },
    {
      "id": "n60rnod",
      "subreddit": "Biohackers",
      "score": 2,
      "body": "i think it's not so much i get easily distracted, but just slower. have you tried anything to track how your brain fog changes or how much brain fog you have?",
      "createdUtc": 1753898884,
      "linkTitle": "[deleted by user]",
      "permalink": "/r/Biohackers/comments/1md3ksn/deleted_by_user/n60rnod/",
      "mentionsSoma": false
    },
    {
      "id": "n60r1it",
      "subreddit": "Biohackers",
      "score": 2,
      "body": "Yeah curious how you were able to figure out all the different effects of different food groups. I feel like there would be so many confounding factors, did you use any tools?",
      "createdUtc": 1753898713,
      "linkTitle": "What made me rethink everything I knew about food",
      "permalink": "/r/Biohackers/comments/1md3vws/what_made_me_rethink_everything_i_knew_about_food/n60r1it/",
      "mentionsSoma": false
    },
    {
      "id": "n60nlcb",
      "subreddit": "cognitiveTesting",
      "score": 2,
      "body": "oh cool thanks will check out the resource list!",
      "createdUtc": 1753897785,
      "linkTitle": "New to cognitive testing",
      "permalink": "/r/cognitiveTesting/comments/1mciof8/new_to_cognitive_testing/n60nlcb/",
      "mentionsSoma": false
    },
    {
      "id": "n60nd1a",
      "subreddit": "LongCovid",
      "score": 1,
      "body": "Oh wow, how did you go about figuring out all of these different things and their effects? I'm always worried about confounding factors. Do you keep track somehow?",
      "createdUtc": 1753897723,
      "linkTitle": "I feel like I've gotten dumber ever since my infection",
      "permalink": "/r/LongCovid/comments/1mcf109/i_feel_like_ive_gotten_dumber_ever_since_my/n60nd1a/",
      "mentionsSoma": false
    },
    {
      "id": "n60mi39",
      "subreddit": "whoop",
      "score": 1,
      "body": "Do you look at these during specific workouts or events or do you pay more attention to the baseline?",
      "createdUtc": 1753897492,
      "linkTitle": "What Whoop scores do you pay most attention to and why?",
      "permalink": "/r/whoop/comments/1mciuen/what_whoop_scores_do_you_pay_most_attention_to/n60mi39/",
      "mentionsSoma": false
    },
    {
      "id": "n60mbex",
      "subreddit": "whoop",
      "score": 1,
      "body": "What does Healthspan actually  measure and how often does it change for you?",
      "createdUtc": 1753897442,
      "linkTitle": "What Whoop scores do you pay most attention to and why?",
      "permalink": "/r/whoop/comments/1mciuen/what_whoop_scores_do_you_pay_most_attention_to/n60mbex/",
      "mentionsSoma": false
    },
    {
      "id": "n60ltz2",
      "subreddit": "whoop",
      "score": 2,
      "body": "What does strain actually measure? Is it how tired your body is?",
      "createdUtc": 1753897313,
      "linkTitle": "What Whoop scores do you pay most attention to and why?",
      "permalink": "/r/whoop/comments/1mciuen/what_whoop_scores_do_you_pay_most_attention_to/n60ltz2/",
      "mentionsSoma": false
    },
    {
      "id": "n5u2z51",
      "subreddit": "Biohackers",
      "score": 1,
      "body": "What do you track HRV for? I use it as an index for stress, but curious what other people think",
      "createdUtc": 1753812448,
      "linkTitle": "Meditation , breathing exercises, do they improve HRV?",
      "permalink": "/r/Biohackers/comments/1mcasen/meditation_breathing_exercises_do_they_improve_hrv/n5u2z51/",
      "mentionsSoma": false
    },
    {
      "id": "n5u2ge8",
      "subreddit": "Biohackers",
      "score": 1,
      "body": "A lot of people are saying genetics, but I also think you can shape sleep with habits. Light exposure in the morning has really helped me. Also, managing stress before sleep improves my sleep quality too",
      "createdUtc": 1753812303,
      "linkTitle": "Friend has sleeping superpowers, how do I learn??",
      "permalink": "/r/Biohackers/comments/1mc8igq/friend_has_sleeping_superpowers_how_do_i_learn/n5u2ge8/",
      "mentionsSoma": false
    },
    {
      "id": "n5u1gp3",
      "subreddit": "NooTopics",
      "score": 1,
      "body": "These comments are super helpful to me too, but how do you guys measure whether your energy / motivation has increased, or whether it's just a placebo from having taken something to increase energy / motivation? Do people have a way of measuring things?",
      "createdUtc": 1753812027,
      "linkTitle": "Does anyone have any recommendations for increasing motivation and energy?",
      "permalink": "/r/NooTopics/comments/1mbqfq7/does_anyone_have_any_recommendations_for/n5u1gp3/",
      "mentionsSoma": false
    },
    {
      "id": "n5u178e",
      "subreddit": "HubermanLab",
      "score": 0,
      "body": "Yeah how do people tell the difference between real and placebo effects? Is there a way to quantify these effects somehow?",
      "createdUtc": 1753811955,
      "linkTitle": "No nootropic effect from creatine HCI",
      "permalink": "/r/HubermanLab/comments/1m8jxfe/no_nootropic_effect_from_creatine_hci/n5u178e/",
      "mentionsSoma": false
    },
    {
      "id": "n5u0j9t",
      "subreddit": "Biohackers",
      "score": 1,
      "body": "Yeah, I think quantifying the brain fog or stress or anything internal has helped me with actually identifying things that really impact how I feel mentally. I don't really take supplements but adjusting my sleep and exercise routines has helped significantly and it shows in my numbers",
      "createdUtc": 1753811776,
      "linkTitle": "brain fog driving me insane wtf do i even try next",
      "permalink": "/r/Biohackers/comments/1mcgt8s/brain_fog_driving_me_insane_wtf_do_i_even_try_next/n5u0j9t/",
      "mentionsSoma": false
    },
    {
      "id": "n5tzjjo",
      "subreddit": "Biohackers",
      "score": 1,
      "body": "Do you ever track your cognitive fitness? i.e. memory, attention, mental clarity, etc. throughout the day and how these supplements affect these aspects of your health? It's a bit more difficult to measure but cognitive changes happen a lot earlier than we are aware of so wondering if that's something you get a pulse on as well",
      "createdUtc": 1753811509,
      "linkTitle": "[deleted by user]",
      "permalink": "/r/Biohackers/comments/1mcgnjl/deleted_by_user/n5tzjjo/",
      "mentionsSoma": false
    },
    {
      "id": "n5ttbv9",
      "subreddit": "LongCovid",
      "score": 2,
      "body": "I've heard of this a lot but for some people the cognitive symptoms come and go, do you guys notice that some days are better than others? Or specific habits or things that improve or worsen these incidences?",
      "createdUtc": 1753809839,
      "linkTitle": "I feel like I've gotten dumber ever since my infection",
      "permalink": "/r/LongCovid/comments/1mcf109/i_feel_like_ive_gotten_dumber_ever_since_my/n5ttbv9/",
      "mentionsSoma": false
    },
    {
      "id": "n5ts8xk",
      "subreddit": "QuantifiedSelf",
      "score": 1,
      "body": "Oh cool, what is the device called? is it constantly recording?",
      "createdUtc": 1753809549,
      "linkTitle": "[deleted by user]",
      "permalink": "/r/QuantifiedSelf/comments/1m6d8un/deleted_by_user/n5ts8xk/",
      "mentionsSoma": false
    },
    {
      "id": "n5mnedf",
      "subreddit": "QuantifiedSelf",
      "score": 2,
      "body": "interesting idea, i feel like diet is so hard to track without hardware but hairclip seems quite niche, have you got other ideas for form factor?",
      "createdUtc": 1753718338,
      "linkTitle": "[deleted by user]",
      "permalink": "/r/QuantifiedSelf/comments/1m6d8un/deleted_by_user/n5mnedf/",
      "mentionsSoma": false
    },
    {
      "id": "n5mmzk0",
      "subreddit": "Biohackers",
      "score": 1,
      "body": "do you use a sleep or cognitive tracker?",
      "createdUtc": 1753718223,
      "linkTitle": "What supplements do you use to boost your memory retaining and learning?",
      "permalink": "/r/Biohackers/comments/1mbfez9/what_supplements_do_you_use_to_boost_your_memory/n5mmzk0/",
      "mentionsSoma": false
    },
    {
      "id": "n5mmvyk",
      "subreddit": "Biohackers",
      "score": 4,
      "body": "how do you measure the effects though? have been wanting to try but always wondered if it’s placebo",
      "createdUtc": 1753718195,
      "linkTitle": "What supplements do you use to boost your memory retaining and learning?",
      "permalink": "/r/Biohackers/comments/1mbfez9/what_supplements_do_you_use_to_boost_your_memory/n5mmvyk/",
      "mentionsSoma": false
    },
    {
      "id": "n5mmq17",
      "subreddit": "longevity",
      "score": 2,
      "body": "Need to read, but does the article talk about burst in aging cognitively, not just physically? I find the cognitive is a lot more subtle and hard to track",
      "createdUtc": 1753718150,
      "linkTitle": "Rapid bursts of ageing are causing a total rethink of how we grow old",
      "permalink": "/r/longevity/comments/1m5t9yg/rapid_bursts_of_ageing_are_causing_a_total/n5mmq17/",
      "mentionsSoma": false
    },
    {
      "id": "n5mmbec",
      "subreddit": "QuantifiedSelf",
      "score": 1,
      "body": "interesting, so how much of this would be proactive tracking vs just plugging in a fitness tracker?",
      "createdUtc": 1753718037,
      "linkTitle": "Another app bla bla, but it's actually great! Community, assemble!!",
      "permalink": "/r/QuantifiedSelf/comments/1m9ux9s/another_app_bla_bla_but_its_actually_great/n5mmbec/",
      "mentionsSoma": false
    },
    {
      "id": "n5ml5qw",
      "subreddit": "coldplunge",
      "score": 1,
      "body": "How cold and how long should the plunge be to feel these effects??",
      "createdUtc": 1753717716,
      "linkTitle": "I did my first cold plunge tonight. 40 degrees for 2 minutes. What next?",
      "permalink": "/r/coldplunge/comments/1maf5g7/i_did_my_first_cold_plunge_tonight_40_degrees_for/n5ml5qw/",
      "mentionsSoma": false
    },
    {
      "id": "n5mkyfy",
      "subreddit": "QuantifiedSelf",
      "score": 2,
      "body": "I’ve found voice journaling to be quite helpful bc I always forget to write stuff down! There’s a few that I’m exploring at the moment, think the voice based ones are really great for capturing details I’d not know to track on excel or on paper",
      "createdUtc": 1753717661,
      "linkTitle": "Analog Systems?",
      "permalink": "/r/QuantifiedSelf/comments/1mbj0tt/analog_systems/n5mkyfy/",
      "mentionsSoma": false
    },
    {
      "id": "n5mkiff",
      "subreddit": "coldplunge",
      "score": 1,
      "body": "How soon after do you feel the effects? So many positives about this",
      "createdUtc": 1753717537,
      "linkTitle": "Six months with a cold tub and didn’t expect this one to hit hardest",
      "permalink": "/r/coldplunge/comments/1mald11/six_months_with_a_cold_tub_and_didnt_expect_this/n5mkiff/",
      "mentionsSoma": false
    },
    {
      "id": "n5mkb3a",
      "subreddit": "coldplunge",
      "score": 1,
      "body": "Besides feeling calm and less tired what else have you felt with the cold plunge? Have been meaning to try it for a while",
      "createdUtc": 1753717480,
      "linkTitle": "Six months with a cold tub and didn’t expect this one to hit hardest",
      "permalink": "/r/coldplunge/comments/1mald11/six_months_with_a_cold_tub_and_didnt_expect_this/n5mkb3a/",
      "mentionsSoma": false
    },
    {
      "id": "n5mjy55",
      "subreddit": "HubermanLab",
      "score": 1,
      "body": "Curious how you keep track of the effects of the different supplements? Seems like there would be some placebo or confounds",
      "createdUtc": 1753717378,
      "linkTitle": "Complete Breakdown of Huberman's Supplement List & What I've Tried",
      "permalink": "/r/HubermanLab/comments/1m5sw9v/complete_breakdown_of_hubermans_supplement_list/n5mjy55/",
      "mentionsSoma": false
    },
    {
      "id": "n5mjgwy",
      "subreddit": "NooTopics",
      "score": 1,
      "body": "How do you guys objectively track the effects of nootropics vs supplements for OCD?",
      "createdUtc": 1753717245,
      "linkTitle": "[deleted by user]",
      "permalink": "/r/NooTopics/comments/1mam2fp/deleted_by_user/n5mjgwy/",
      "mentionsSoma": false
    },
    {
      "id": "n5mizya",
      "subreddit": "QuantifiedSelf",
      "score": 1,
      "body": "oh that’s a good idea! what habit tracking apps do people use? installing a button seems like a lot of work…",
      "createdUtc": 1753717113,
      "linkTitle": "Does anyone combine physical devices with habit tracking apps?",
      "permalink": "/r/QuantifiedSelf/comments/1mbfugt/does_anyone_combine_physical_devices_with_habit/n5mizya/",
      "mentionsSoma": false
    },
    {
      "id": "mgwljk7",
      "subreddit": "Biohackers",
      "score": 1,
      "body": "Hm I wonder if more objective measures for cognitive effects would be useful",
      "createdUtc": 1741550240,
      "linkTitle": "[deleted by user]",
      "permalink": "/r/Biohackers/comments/1j5mhre/deleted_by_user/mgwljk7/",
      "mentionsSoma": false
    },
    {
      "id": "mgwlapo",
      "subreddit": "QuantifiedSelf",
      "score": 2,
      "body": "Fabulous! You should've received an email from me :)",
      "createdUtc": 1741550162,
      "linkTitle": "Tracking mental acuity and cognitive performance",
      "permalink": "/r/QuantifiedSelf/comments/1j54zsk/tracking_mental_acuity_and_cognitive_performance/mgwlapo/",
      "mentionsSoma": false
    },
    {
      "id": "mgpjp8s",
      "subreddit": "longevity_protocol",
      "score": 1,
      "body": "No it’s meant for anyone! Tracking cognitive changes at a younger age is important for preventative health. I usually show a quick demo for early users too.",
      "createdUtc": 1741453307,
      "linkTitle": "Tracking cognitive health",
      "permalink": "/r/longevity_protocol/comments/1j62j0g/tracking_cognitive_health/mgpjp8s/",
      "mentionsSoma": false
    },
    {
      "id": "mglefa5",
      "subreddit": "Biohackers",
      "score": 2,
      "body": "How do people track these cognitive effects and changes? Unless of course when they're so obvious.",
      "createdUtc": 1741388833,
      "linkTitle": "[deleted by user]",
      "permalink": "/r/Biohackers/comments/1j5mhre/deleted_by_user/mglefa5/",
      "mentionsSoma": false
    },
    {
      "id": "mge02je",
      "subreddit": "QuantifiedSelf",
      "score": 2,
      "body": "Hi! I'm actually building a tool to help people track mental acuity and other cognitive functions through speech analysis, think of it as a \"Strava for Cognition.\" We're looking for early users to test and help shape the product, drop your contact if you're interested! [https://airtable.com/appczl6TRhOwcUBKu/pagz9QaSGqFqK9evY/form](https://airtable.com/appczl6TRhOwcUBKu/pagz9QaSGqFqK9evY/form)",
      "createdUtc": 1741291769,
      "linkTitle": "How Do You Track Mental & Creative Performance?",
      "permalink": "/r/QuantifiedSelf/comments/1j4x43x/how_do_you_track_mental_creative_performance/mge02je/",
      "mentionsSoma": false
    },
    {
      "id": "mg7e30e",
      "subreddit": "Concussion",
      "score": 1,
      "body": "I'm building a tool to help people objectively measure cognitive changes over time. Kind of like a \"Strava for cognition.\" We use speech analysis to track mental acuity, verbal fluency, engagement, and other cognitive domains, useful for stay on top of the recovery process and identify patterns and trends that could help you make adjustments to your daily habits. Let me know if you want to give it a try! (others welcome too, just drop your contact here: https://airtable.com/appczl6TRhOwcUBKu/pagz9QaSGqFqK9evY/form)",
      "createdUtc": 1741204987,
      "linkTitle": "Will I ever fully regain my cognition? (1.5 Months on)",
      "permalink": "/r/Concussion/comments/1j2i1r9/will_i_ever_fully_regain_my_cognition_15_months_on/mg7e30e/",
      "mentionsSoma": false
    },
    {
      "id": "mg7d7xx",
      "subreddit": "Concussion",
      "score": 1,
      "body": "I'm building a tool for people to track their cognitive functions continuously via voice - think of it as a Strava for Cognition. It helps track trends on your mental acuity, engagement, communications clarity, and more. Could be useful to help track recovery progress, let me know if you want to give it a try (anyone else interested could leave their contact too: [https://airtable.com/appczl6TRhOwcUBKu/pagz9QaSGqFqK9evY/form](https://airtable.com/appczl6TRhOwcUBKu/pagz9QaSGqFqK9evY/form)",
      "createdUtc": 1741204745,
      "linkTitle": "4 weeks post concussion - seeking advice",
      "permalink": "/r/Concussion/comments/1j3e6n0/4_weeks_post_concussion_seeking_advice/mg7d7xx/",
      "mentionsSoma": false
    },
    {
      "id": "mg7cqvo",
      "subreddit": "Concussion",
      "score": 1,
      "body": "How do you keep track of your recovery especially as it relates to your cognitive function - are you generally feeling less focused, coordinated, etc.?",
      "createdUtc": 1741204612,
      "linkTitle": "*DJ Khalid voice* Another One",
      "permalink": "/r/Concussion/comments/1j3tslh/dj_khalid_voice_another_one/mg7cqvo/",
      "mentionsSoma": false
    },
    {
      "id": "mg10kob",
      "subreddit": "Biohackers",
      "score": 1,
      "body": "how do people even measure their cognitive function or objectively know if a supplement is working? I sometimes feel like I might just have had a bad night's sleep instead of aging-related...",
      "createdUtc": 1741121559,
      "linkTitle": "Are there any safe supplements for memory and cognition in aging parents? Everything seems to have side effects.",
      "permalink": "/r/Biohackers/comments/1j31r3n/are_there_any_safe_supplements_for_memory_and/mg10kob/",
      "mentionsSoma": false
    },
    {
      "id": "mg0zk6g",
      "subreddit": "Biohackers",
      "score": 1,
      "body": "What do people think about cognitive exams? Cognitive changes and mild cognitive impairment can start even in your 30s but we don't really have access to any routine checkups",
      "createdUtc": 1741121278,
      "linkTitle": "What yearly tests do you recommend once you reach 40?",
      "permalink": "/r/Biohackers/comments/1j34ea2/what_yearly_tests_do_you_recommend_once_you_reach/mg0zk6g/",
      "mentionsSoma": false
    },
    {
      "id": "mg0z6k8",
      "subreddit": "Biohackers",
      "score": 2,
      "body": "Hi! Sorry to hear about this, it must be so frustrating. I'm curious how you've been tracking your cognitive decline and baseline? I'm working on a noninvasive and continuous cognition tracker (\"strava for cognition\"), let me know if you'd be interested in trying it out! Others as well - feel free to reach out at [jiali@soma-health.com](mailto:jiali@soma-health.com)",
      "createdUtc": 1741121176,
      "linkTitle": "[deleted by user]",
      "permalink": "/r/Biohackers/comments/1j3dr89/deleted_by_user/mg0z6k8/",
      "mentionsSoma": true
    },
    {
      "id": "mf5j72l",
      "subreddit": "migraine",
      "score": 1,
      "body": "thanks for the feedback everyone, I’m actually working on something that would continuously track your cognitive function. if you want to learn more just leave your email here https://airtable.com/appczl6TRhOwcUBKu/pagz9QaSGqFqK9evY/form",
      "createdUtc": 1740696146,
      "linkTitle": "Cognitive function tracking",
      "permalink": "/r/migraine/comments/1iz1lol/cognitive_function_tracking/mf5j72l/",
      "mentionsSoma": false
    },
    {
      "id": "mez8fab",
      "subreddit": "cognitiveTesting",
      "score": 1,
      "body": "Different parts of cognitive function that make up your IQ peak and plateau at different ages, some as early as teens but some later in life.",
      "createdUtc": 1740612828,
      "linkTitle": "At what exact age does IQ really stabilize?",
      "permalink": "/r/cognitiveTesting/comments/1iyayjo/at_what_exact_age_does_iq_really_stabilize/mez8fab/",
      "mentionsSoma": false
    },
    {
      "id": "mez87pe",
      "subreddit": "covidlonghaulers",
      "score": 1,
      "body": "congrats on your recovery!!",
      "createdUtc": 1740612759,
      "linkTitle": "Full Recovery From Long Covid After Three Years!",
      "permalink": "/r/covidlonghaulers/comments/1iyuuvd/full_recovery_from_long_covid_after_three_years/mez87pe/",
      "mentionsSoma": false
    },
    {
      "id": "mez80qv",
      "subreddit": "immortalists",
      "score": 1,
      "body": "does aging include dementia? life expectancy is longer but directly leads to more dementia cases…",
      "createdUtc": 1740612695,
      "linkTitle": "What would be the new stages of life if humans beat aging?",
      "permalink": "/r/immortalists/comments/1iy3yel/what_would_be_the_new_stages_of_life_if_humans/mez80qv/",
      "mentionsSoma": false
    },
    {
      "id": "mez5xuv",
      "subreddit": "Biohackers",
      "score": 1,
      "body": "How do you even know if something helped? Are there objective measures of cognitive function that people use?",
      "createdUtc": 1740612024,
      "linkTitle": "What supplements have helped you the most for your memory retention and overall brain health?",
      "permalink": "/r/Biohackers/comments/1iyz752/what_supplements_have_helped_you_the_most_for/mez5xuv/",
      "mentionsSoma": false
    },
    {
      "id": "m9ncaq7",
      "subreddit": "Biohackers",
      "score": 1,
      "body": "It’s all about setting a personalized baseline! So we’ll take into account other confounding conditions to speech for each individual. This is similar to how confounding conditions might affect the baseline resting heart rate for each person. Shoot me an email and happy to share more!",
      "createdUtc": 1738077696,
      "linkTitle": "[deleted by user]",
      "permalink": "/r/Biohackers/comments/1ibtniw/deleted_by_user/m9ncaq7/",
      "mentionsSoma": false
    },
    {
      "id": "m9nbnle",
      "subreddit": "Biohackers",
      "score": 1,
      "body": "That’s fine because we’ll take it into account and adjust your baseline accordingly! Send me an email and happy to share more and answer other questions you have :)",
      "createdUtc": 1738077505,
      "linkTitle": "[deleted by user]",
      "permalink": "/r/Biohackers/comments/1ibtniw/deleted_by_user/m9nbnle/",
      "mentionsSoma": false
    },
    {
      "id": "m8tpqgx",
      "subreddit": "migraine",
      "score": 1,
      "body": "Do you ever track the immediate signs and symptoms before and after the migraine? for helping to figure out triggers and such",
      "createdUtc": 1737678284,
      "linkTitle": "All the Migraines I had in 2024. Wish they could just not happen",
      "permalink": "/r/migraine/comments/1i82tcc/all_the_migraines_i_had_in_2024_wish_they_could/m8tpqgx/",
      "mentionsSoma": false
    },
    {
      "id": "m5l3g41",
      "subreddit": "Biohackers",
      "score": 1,
      "body": "Hm, what do you mean by small letters?",
      "createdUtc": 1736111199,
      "linkTitle": "[deleted by user]",
      "permalink": "/r/Biohackers/comments/1hubz94/deleted_by_user/m5l3g41/",
      "mentionsSoma": false
    },
    {
      "id": "m3217g2",
      "subreddit": "neurology",
      "score": 1,
      "body": "Thank you! I sent you a DM, would love to chat :)",
      "createdUtc": 1734736427,
      "linkTitle": "[deleted by user]",
      "permalink": "/r/neurology/comments/1hgikuk/deleted_by_user/m3217g2/",
      "mentionsSoma": false
    },
    {
      "id": "m2jhgu7",
      "subreddit": "migraine",
      "score": 1,
      "body": "huh that's 2/2 for migraine buddy, what does it do for you?",
      "createdUtc": 1734463836,
      "linkTitle": "Migraine apps/tools?",
      "permalink": "/r/migraine/comments/1hgiew8/migraine_appstools/m2jhgu7/",
      "mentionsSoma": false
    },
    {
      "id": "m2jhdwb",
      "subreddit": "migraine",
      "score": 1,
      "body": "oh cool, can you explain the pros/cons? how do you actually use them?",
      "createdUtc": 1734463810,
      "linkTitle": "Migraine apps/tools?",
      "permalink": "/r/migraine/comments/1hgiew8/migraine_appstools/m2jhdwb/",
      "mentionsSoma": false
    }
  ],
  "fetchedAt": 1771457767714
}